analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/gcr_regs.h
#define MXC_F_GCR_RST0_UART0_POS                       11 /**< RST0_UART0 Position */
#define MXC_F_GCR_RST0_UART0                           ((uint32_t)(0x1UL << MXC_F_GCR_RST0_UART0_POS)) /**< RST0_UART0 Mask */

#define MXC_F_GCR_RST0_UART1_POS                       12 /**< RST0_UART1 Position */
#define MXC_F_GCR_RST0_UART1                           ((uint32_t)(0x1UL << MXC_F_GCR_RST0_UART1_POS)) /**< RST0_UART1 Mask */

#define MXC_F_GCR_RST0_SPI0_POS                        13 /**< RST0_SPI0 Position */
#define MXC_F_GCR_RST0_SPI0                            ((uint32_t)(0x1UL << MXC_F_GCR_RST0_SPI0_POS)) /**< RST0_SPI0 Mask */

#define MXC_F_GCR_RST0_SPI1_POS                        14 /**< RST0_SPI1 Position */
#define MXC_F_GCR_RST0_SPI1                            ((uint32_t)(0x1UL << MXC_F_GCR_RST0_SPI1_POS)) /**< RST0_SPI1 Mask */

#define MXC_F_GCR_RST0_SPI2_POS                        15 /**< RST0_SPI2 Position */
#define MXC_F_GCR_RST0_SPI2                            ((uint32_t)(0x1UL << MXC_F_GCR_RST0_SPI2_POS)) /**< RST0_SPI2 Mask */

#define MXC_F_GCR_RST0_I2C0_POS                        16 /**< RST0_I2C0 Position */
#define MXC_F_GCR_RST0_I2C0                            ((uint32_t)(0x1UL << MXC_F_GCR_RST0_I2C0_POS)) /**< RST0_I2C0 Mask */

#define MXC_F_GCR_RST0_RTC_POS                         17 /**< RST0_RTC Position */
#define MXC_F_GCR_RST0_RTC                             ((uint32_t)(0x1UL << MXC_F_GCR_RST0_RTC_POS)) /**< RST0_RTC Mask */

#define MXC_F_GCR_RST0_TPU_POS                         18 /**< RST0_TPU Position */
#define MXC_F_GCR_RST0_TPU                             ((uint32_t)(0x1UL << MXC_F_GCR_RST0_TPU_POS)) /**< RST0_TPU Mask */

#define MXC_F_GCR_RST0_HBC_POS                         21 /**< RST0_HBC Position */
#define MXC_F_GCR_RST0_HBC                             ((uint32_t)(0x1UL << MXC_F_GCR_RST0_HBC_POS)) /**< RST0_HBC Mask */

#define MXC_F_GCR_RST0_TFT_POS                         22 /**< RST0_TFT Position */
#define MXC_F_GCR_RST0_TFT                             ((uint32_t)(0x1UL << MXC_F_GCR_RST0_TFT_POS)) /**< RST0_TFT Mask */

#define MXC_F_GCR_RST0_USB_POS                         23 /**< RST0_USB Position */
#define MXC_F_GCR_RST0_USB                             ((uint32_t)(0x1UL << MXC_F_GCR_RST0_USB_POS)) /**< RST0_USB Mask */

#define MXC_F_GCR_RST0_ADC_POS                         26 /**< RST0_ADC Position */
#define MXC_F_GCR_RST0_ADC                             ((uint32_t)(0x1UL << MXC_F_GCR_RST0_ADC_POS)) /**< RST0_ADC Mask */

#define MXC_F_GCR_RST0_UART2_POS                       28 /**< RST0_UART2 Position */
#define MXC_F_GCR_RST0_UART2                           ((uint32_t)(0x1UL << MXC_F_GCR_RST0_UART2_POS)) /**< RST0_UART2 Mask */

#define MXC_F_GCR_RST0_SOFT_POS                        29 /**< RST0_SOFT Position */
#define MXC_F_GCR_RST0_SOFT                            ((uint32_t)(0x1UL << MXC_F_GCR_RST0_SOFT_POS)) /**< RST0_SOFT Mask */

#define MXC_F_GCR_RST0_PERIPH_POS                      30 /**< RST0_PERIPH Position */
#define MXC_F_GCR_RST0_PERIPH                          ((uint32_t)(0x1UL << MXC_F_GCR_RST0_PERIPH_POS)) /**< RST0_PERIPH Mask */

#define MXC_F_GCR_RST0_SYS_POS                         31 /**< RST0_SYS Position */
#define MXC_F_GCR_RST0_SYS                             ((uint32_t)(0x1UL << MXC_F_GCR_RST0_SYS_POS)) /**< RST0_SYS Mask */

/**@} end of group GCR_RST0_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_CLK_CTRL GCR_CLK_CTRL
 * @brief    Clock Control.
 * @{
 */
#define MXC_F_GCR_CLK_CTRL_SYSCLK_PRESCALE_POS         6 /**< CLK_CTRL_SYSCLK_PRESCALE Position */
#define MXC_F_GCR_CLK_CTRL_SYSCLK_PRESCALE             ((uint32_t)(0x7UL << MXC_F_GCR_CLK_CTRL_SYSCLK_PRESCALE_POS)) /**< CLK_CTRL_SYSCLK_PRESCALE Mask */
#define MXC_V_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV1        ((uint32_t)0x0UL) /**< CLK_CTRL_SYSCLK_PRESCALE_DIV1 Value */
#define MXC_S_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV1        (MXC_V_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV1 << MXC_F_GCR_CLK_CTRL_SYSCLK_PRESCALE_POS) /**< CLK_CTRL_SYSCLK_PRESCALE_DIV1 Setting */
#define MXC_V_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV2        ((uint32_t)0x1UL) /**< CLK_CTRL_SYSCLK_PRESCALE_DIV2 Value */
#define MXC_S_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV2        (MXC_V_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV2 << MXC_F_GCR_CLK_CTRL_SYSCLK_PRESCALE_POS) /**< CLK_CTRL_SYSCLK_PRESCALE_DIV2 Setting */
#define MXC_V_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV4        ((uint32_t)0x2UL) /**< CLK_CTRL_SYSCLK_PRESCALE_DIV4 Value */
#define MXC_S_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV4        (MXC_V_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV4 << MXC_F_GCR_CLK_CTRL_SYSCLK_PRESCALE_POS) /**< CLK_CTRL_SYSCLK_PRESCALE_DIV4 Setting */
#define MXC_V_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV8        ((uint32_t)0x3UL) /**< CLK_CTRL_SYSCLK_PRESCALE_DIV8 Value */
#define MXC_S_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV8        (MXC_V_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV8 << MXC_F_GCR_CLK_CTRL_SYSCLK_PRESCALE_POS) /**< CLK_CTRL_SYSCLK_PRESCALE_DIV8 Setting */
#define MXC_V_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV16       ((uint32_t)0x4UL) /**< CLK_CTRL_SYSCLK_PRESCALE_DIV16 Value */
#define MXC_S_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV16       (MXC_V_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV16 << MXC_F_GCR_CLK_CTRL_SYSCLK_PRESCALE_POS) /**< CLK_CTRL_SYSCLK_PRESCALE_DIV16 Setting */
#define MXC_V_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV32       ((uint32_t)0x5UL) /**< CLK_CTRL_SYSCLK_PRESCALE_DIV32 Value */
#define MXC_S_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV32       (MXC_V_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV32 << MXC_F_GCR_CLK_CTRL_SYSCLK_PRESCALE_POS) /**< CLK_CTRL_SYSCLK_PRESCALE_DIV32 Setting */
#define MXC_V_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV64       ((uint32_t)0x6UL) /**< CLK_CTRL_SYSCLK_PRESCALE_DIV64 Value */
#define MXC_S_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV64       (MXC_V_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV64 << MXC_F_GCR_CLK_CTRL_SYSCLK_PRESCALE_POS) /**< CLK_CTRL_SYSCLK_PRESCALE_DIV64 Setting */
#define MXC_V_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV128      ((uint32_t)0x7UL) /**< CLK_CTRL_SYSCLK_PRESCALE_DIV128 Value */
#define MXC_S_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV128      (MXC_V_GCR_CLK_CTRL_SYSCLK_PRESCALE_DIV128 << MXC_F_GCR_CLK_CTRL_SYSCLK_PRESCALE_POS) /**< CLK_CTRL_SYSCLK_PRESCALE_DIV128 Setting */

#define MXC_F_GCR_CLK_CTRL_SYSOSC_SEL_POS              9 /**< CLK_CTRL_SYSOSC_SEL Position */
#define MXC_F_GCR_CLK_CTRL_SYSOSC_SEL                  ((uint32_t)(0x7UL << MXC_F_GCR_CLK_CTRL_SYSOSC_SEL_POS)) /**< CLK_CTRL_SYSOSC_SEL Mask */
#define MXC_V_GCR_CLK_CTRL_SYSOSC_SEL_CRYPTO           ((uint32_t)0x0UL) /**< CLK_CTRL_SYSOSC_SEL_CRYPTO Value */
#define MXC_S_GCR_CLK_CTRL_SYSOSC_SEL_CRYPTO           (MXC_V_GCR_CLK_CTRL_SYSOSC_SEL_CRYPTO << MXC_F_GCR_CLK_CTRL_SYSOSC_SEL_POS) /**< CLK_CTRL_SYSOSC_SEL_CRYPTO Setting */
#define MXC_V_GCR_CLK_CTRL_SYSOSC_SEL_HFXIN            ((uint32_t)0x2UL) /**< CLK_CTRL_SYSOSC_SEL_HFXIN Value */
#define MXC_S_GCR_CLK_CTRL_SYSOSC_SEL_HFXIN            (MXC_V_GCR_CLK_CTRL_SYSOSC_SEL_HFXIN << MXC_F_GCR_CLK_CTRL_SYSOSC_SEL_POS) /**< CLK_CTRL_SYSOSC_SEL_HFXIN Setting */
#define MXC_V_GCR_CLK_CTRL_SYSOSC_SEL_NANORING         ((uint32_t)0x3UL) /**< CLK_CTRL_SYSOSC_SEL_NANORING Value */
#define MXC_S_GCR_CLK_CTRL_SYSOSC_SEL_NANORING         (MXC_V_GCR_CLK_CTRL_SYSOSC_SEL_NANORING << MXC_F_GCR_CLK_CTRL_SYSOSC_SEL_POS) /**< CLK_CTRL_SYSOSC_SEL_NANORING Setting */
#define MXC_V_GCR_CLK_CTRL_SYSOSC_SEL_HIRC96           ((uint32_t)0x4UL) /**< CLK_CTRL_SYSOSC_SEL_HIRC96 Value */
#define MXC_S_GCR_CLK_CTRL_SYSOSC_SEL_HIRC96           (MXC_V_GCR_CLK_CTRL_SYSOSC_SEL_HIRC96 << MXC_F_GCR_CLK_CTRL_SYSOSC_SEL_POS) /**< CLK_CTRL_SYSOSC_SEL_HIRC96 Setting */
#define MXC_V_GCR_CLK_CTRL_SYSOSC_SEL_HIRC8            ((uint32_t)0x5UL) /**< CLK_CTRL_SYSOSC_SEL_HIRC8 Value */
#define MXC_S_GCR_CLK_CTRL_SYSOSC_SEL_HIRC8            (MXC_V_GCR_CLK_CTRL_SYSOSC_SEL_HIRC8 << MXC_F_GCR_CLK_CTRL_SYSOSC_SEL_POS) /**< CLK_CTRL_SYSOSC_SEL_HIRC8 Setting */
#define MXC_V_GCR_CLK_CTRL_SYSOSC_SEL_X32K             ((uint32_t)0x6UL) /**< CLK_CTRL_SYSOSC_SEL_X32K Value */
#define MXC_S_GCR_CLK_CTRL_SYSOSC_SEL_X32K             (MXC_V_GCR_CLK_CTRL_SYSOSC_SEL_X32K << MXC_F_GCR_CLK_CTRL_SYSOSC_SEL_POS) /**< CLK_CTRL_SYSOSC_SEL_X32K Setting */

#define MXC_F_GCR_CLK_CTRL_SYSOSC_RDY_POS              13 /**< CLK_CTRL_SYSOSC_RDY Position */
#define MXC_F_GCR_CLK_CTRL_SYSOSC_RDY                  ((uint32_t)(0x1UL << MXC_F_GCR_CLK_CTRL_SYSOSC_RDY_POS)) /**< CLK_CTRL_SYSOSC_RDY Mask */
#define MXC_V_GCR_CLK_CTRL_SYSOSC_RDY_BUSY             ((uint32_t)0x0UL) /**< CLK_CTRL_SYSOSC_RDY_BUSY Value */
#define MXC_S_GCR_CLK_CTRL_SYSOSC_RDY_BUSY             (MXC_V_GCR_CLK_CTRL_SYSOSC_RDY_BUSY << MXC_F_GCR_CLK_CTRL_SYSOSC_RDY_POS) /**< CLK_CTRL_SYSOSC_RDY_BUSY Setting */
#define MXC_V_GCR_CLK_CTRL_SYSOSC_RDY_READY            ((uint32_t)0x1UL) /**< CLK_CTRL_SYSOSC_RDY_READY Value */
#define MXC_S_GCR_CLK_CTRL_SYSOSC_RDY_READY            (MXC_V_GCR_CLK_CTRL_SYSOSC_RDY_READY << MXC_F_GCR_CLK_CTRL_SYSOSC_RDY_POS) /**< CLK_CTRL_SYSOSC_RDY_READY Setting */

#define MXC_F_GCR_CLK_CTRL_CCD_POS                     15 /**< CLK_CTRL_CCD Position */
#define MXC_F_GCR_CLK_CTRL_CCD                         ((uint32_t)(0x1UL << MXC_F_GCR_CLK_CTRL_CCD_POS)) /**< CLK_CTRL_CCD Mask */
#define MXC_V_GCR_CLK_CTRL_CCD_NON_DIV                 ((uint32_t)0x0UL) /**< CLK_CTRL_CCD_NON_DIV Value */
#define MXC_S_GCR_CLK_CTRL_CCD_NON_DIV                 (MXC_V_GCR_CLK_CTRL_CCD_NON_DIV << MXC_F_GCR_CLK_CTRL_CCD_POS) /**< CLK_CTRL_CCD_NON_DIV Setting */
#define MXC_V_GCR_CLK_CTRL_CCD_DIV                     ((uint32_t)0x1UL) /**< CLK_CTRL_CCD_DIV Value */
#define MXC_S_GCR_CLK_CTRL_CCD_DIV                     (MXC_V_GCR_CLK_CTRL_CCD_DIV << MXC_F_GCR_CLK_CTRL_CCD_POS) /**< CLK_CTRL_CCD_DIV Setting */

