analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/gcr_regs.h
#define MXC_F_GCR_CLK_CTRL_X32K_EN_POS                 17 /**< CLK_CTRL_X32K_EN Position */
#define MXC_F_GCR_CLK_CTRL_X32K_EN                     ((uint32_t)(0x1UL << MXC_F_GCR_CLK_CTRL_X32K_EN_POS)) /**< CLK_CTRL_X32K_EN Mask */

#define MXC_F_GCR_CLK_CTRL_CRYPTO_EN_POS               18 /**< CLK_CTRL_CRYPTO_EN Position */
#define MXC_F_GCR_CLK_CTRL_CRYPTO_EN                   ((uint32_t)(0x1UL << MXC_F_GCR_CLK_CTRL_CRYPTO_EN_POS)) /**< CLK_CTRL_CRYPTO_EN Mask */

#define MXC_F_GCR_CLK_CTRL_HIRC96_EN_POS               19 /**< CLK_CTRL_HIRC96_EN Position */
#define MXC_F_GCR_CLK_CTRL_HIRC96_EN                   ((uint32_t)(0x1UL << MXC_F_GCR_CLK_CTRL_HIRC96_EN_POS)) /**< CLK_CTRL_HIRC96_EN Mask */

#define MXC_F_GCR_CLK_CTRL_HIRC8_EN_POS                20 /**< CLK_CTRL_HIRC8_EN Position */
#define MXC_F_GCR_CLK_CTRL_HIRC8_EN                    ((uint32_t)(0x1UL << MXC_F_GCR_CLK_CTRL_HIRC8_EN_POS)) /**< CLK_CTRL_HIRC8_EN Mask */

#define MXC_F_GCR_CLK_CTRL_HIRC8_VS_POS                21 /**< CLK_CTRL_HIRC8_VS Position */
#define MXC_F_GCR_CLK_CTRL_HIRC8_VS                    ((uint32_t)(0x1UL << MXC_F_GCR_CLK_CTRL_HIRC8_VS_POS)) /**< CLK_CTRL_HIRC8_VS Mask */

#define MXC_F_GCR_CLK_CTRL_X32K_RDY_POS                25 /**< CLK_CTRL_X32K_RDY Position */
#define MXC_F_GCR_CLK_CTRL_X32K_RDY                    ((uint32_t)(0x1UL << MXC_F_GCR_CLK_CTRL_X32K_RDY_POS)) /**< CLK_CTRL_X32K_RDY Mask */

#define MXC_F_GCR_CLK_CTRL_CRYPTO_RDY_POS              26 /**< CLK_CTRL_CRYPTO_RDY Position */
#define MXC_F_GCR_CLK_CTRL_CRYPTO_RDY                  ((uint32_t)(0x1UL << MXC_F_GCR_CLK_CTRL_CRYPTO_RDY_POS)) /**< CLK_CTRL_CRYPTO_RDY Mask */

#define MXC_F_GCR_CLK_CTRL_HIRC96_RDY_POS              27 /**< CLK_CTRL_HIRC96_RDY Position */
#define MXC_F_GCR_CLK_CTRL_HIRC96_RDY                  ((uint32_t)(0x1UL << MXC_F_GCR_CLK_CTRL_HIRC96_RDY_POS)) /**< CLK_CTRL_HIRC96_RDY Mask */

#define MXC_F_GCR_CLK_CTRL_HIRC8_RDY_POS               28 /**< CLK_CTRL_HIRC8_RDY Position */
#define MXC_F_GCR_CLK_CTRL_HIRC8_RDY                   ((uint32_t)(0x1UL << MXC_F_GCR_CLK_CTRL_HIRC8_RDY_POS)) /**< CLK_CTRL_HIRC8_RDY Mask */

#define MXC_F_GCR_CLK_CTRL_NANORING_RDY_POS            29 /**< CLK_CTRL_NANORING_RDY Position */
#define MXC_F_GCR_CLK_CTRL_NANORING_RDY                ((uint32_t)(0x1UL << MXC_F_GCR_CLK_CTRL_NANORING_RDY_POS)) /**< CLK_CTRL_NANORING_RDY Mask */

/**@} end of group GCR_CLK_CTRL_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_PMR GCR_PMR
 * @brief    Power Management.
 * @{
 */
#define MXC_F_GCR_PMR_MODE_POS                         0 /**< PMR_MODE Position */
#define MXC_F_GCR_PMR_MODE                             ((uint32_t)(0x7UL << MXC_F_GCR_PMR_MODE_POS)) /**< PMR_MODE Mask */
#define MXC_V_GCR_PMR_MODE_ACTIVE                      ((uint32_t)0x0UL) /**< PMR_MODE_ACTIVE Value */
#define MXC_S_GCR_PMR_MODE_ACTIVE                      (MXC_V_GCR_PMR_MODE_ACTIVE << MXC_F_GCR_PMR_MODE_POS) /**< PMR_MODE_ACTIVE Setting */
#define MXC_V_GCR_PMR_MODE_SHUTDOWN                    ((uint32_t)0x3UL) /**< PMR_MODE_SHUTDOWN Value */
#define MXC_S_GCR_PMR_MODE_SHUTDOWN                    (MXC_V_GCR_PMR_MODE_SHUTDOWN << MXC_F_GCR_PMR_MODE_POS) /**< PMR_MODE_SHUTDOWN Setting */
#define MXC_V_GCR_PMR_MODE_BACKUP                      ((uint32_t)0x4UL) /**< PMR_MODE_BACKUP Value */
#define MXC_S_GCR_PMR_MODE_BACKUP                      (MXC_V_GCR_PMR_MODE_BACKUP << MXC_F_GCR_PMR_MODE_POS) /**< PMR_MODE_BACKUP Setting */

#define MXC_F_GCR_PMR_GPIOWKEN_POS                     4 /**< PMR_GPIOWKEN Position */
#define MXC_F_GCR_PMR_GPIOWKEN                         ((uint32_t)(0x1UL << MXC_F_GCR_PMR_GPIOWKEN_POS)) /**< PMR_GPIOWKEN Mask */

#define MXC_F_GCR_PMR_RTCWKEN_POS                      5 /**< PMR_RTCWKEN Position */
#define MXC_F_GCR_PMR_RTCWKEN                          ((uint32_t)(0x1UL << MXC_F_GCR_PMR_RTCWKEN_POS)) /**< PMR_RTCWKEN Mask */

#define MXC_F_GCR_PMR_USBWKEN_POS                      6 /**< PMR_USBWKEN Position */
#define MXC_F_GCR_PMR_USBWKEN                          ((uint32_t)(0x1UL << MXC_F_GCR_PMR_USBWKEN_POS)) /**< PMR_USBWKEN Mask */

#define MXC_F_GCR_PMR_CRYPTOPD_POS                     15 /**< PMR_CRYPTOPD Position */
#define MXC_F_GCR_PMR_CRYPTOPD                         ((uint32_t)(0x1UL << MXC_F_GCR_PMR_CRYPTOPD_POS)) /**< PMR_CRYPTOPD Mask */
#define MXC_V_GCR_PMR_CRYPTOPD_ACTIVE                  ((uint32_t)0x0UL) /**< PMR_CRYPTOPD_ACTIVE Value */
#define MXC_S_GCR_PMR_CRYPTOPD_ACTIVE                  (MXC_V_GCR_PMR_CRYPTOPD_ACTIVE << MXC_F_GCR_PMR_CRYPTOPD_POS) /**< PMR_CRYPTOPD_ACTIVE Setting */
#define MXC_V_GCR_PMR_CRYPTOPD_DEEPSLEEP               ((uint32_t)0x1UL) /**< PMR_CRYPTOPD_DEEPSLEEP Value */
#define MXC_S_GCR_PMR_CRYPTOPD_DEEPSLEEP               (MXC_V_GCR_PMR_CRYPTOPD_DEEPSLEEP << MXC_F_GCR_PMR_CRYPTOPD_POS) /**< PMR_CRYPTOPD_DEEPSLEEP Setting */

#define MXC_F_GCR_PMR_HIRC96PD_POS                     16 /**< PMR_HIRC96PD Position */
#define MXC_F_GCR_PMR_HIRC96PD                         ((uint32_t)(0x1UL << MXC_F_GCR_PMR_HIRC96PD_POS)) /**< PMR_HIRC96PD Mask */
#define MXC_V_GCR_PMR_HIRC96PD_ACTIVE                  ((uint32_t)0x0UL) /**< PMR_HIRC96PD_ACTIVE Value */
#define MXC_S_GCR_PMR_HIRC96PD_ACTIVE                  (MXC_V_GCR_PMR_HIRC96PD_ACTIVE << MXC_F_GCR_PMR_HIRC96PD_POS) /**< PMR_HIRC96PD_ACTIVE Setting */
#define MXC_V_GCR_PMR_HIRC96PD_DEEPSLEEP               ((uint32_t)0x1UL) /**< PMR_HIRC96PD_DEEPSLEEP Value */
#define MXC_S_GCR_PMR_HIRC96PD_DEEPSLEEP               (MXC_V_GCR_PMR_HIRC96PD_DEEPSLEEP << MXC_F_GCR_PMR_HIRC96PD_POS) /**< PMR_HIRC96PD_DEEPSLEEP Setting */

#define MXC_F_GCR_PMR_HIRC8PD_POS                      17 /**< PMR_HIRC8PD Position */
#define MXC_F_GCR_PMR_HIRC8PD                          ((uint32_t)(0x1UL << MXC_F_GCR_PMR_HIRC8PD_POS)) /**< PMR_HIRC8PD Mask */
#define MXC_V_GCR_PMR_HIRC8PD_ACTIVE                   ((uint32_t)0x0UL) /**< PMR_HIRC8PD_ACTIVE Value */
#define MXC_S_GCR_PMR_HIRC8PD_ACTIVE                   (MXC_V_GCR_PMR_HIRC8PD_ACTIVE << MXC_F_GCR_PMR_HIRC8PD_POS) /**< PMR_HIRC8PD_ACTIVE Setting */
#define MXC_V_GCR_PMR_HIRC8PD_DEEPSLEEP                ((uint32_t)0x1UL) /**< PMR_HIRC8PD_DEEPSLEEP Value */
#define MXC_S_GCR_PMR_HIRC8PD_DEEPSLEEP                (MXC_V_GCR_PMR_HIRC8PD_DEEPSLEEP << MXC_F_GCR_PMR_HIRC8PD_POS) /**< PMR_HIRC8PD_DEEPSLEEP Setting */

/**@} end of group GCR_PMR_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_PCLK_DIV GCR_PCLK_DIV
 * @brief    Peripheral Clock Divider.
 * @{
 */
#define MXC_F_GCR_PCLK_DIV_SDHCFRQ_POS                 7 /**< PCLK_DIV_SDHCFRQ Position */
#define MXC_F_GCR_PCLK_DIV_SDHCFRQ                     ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIV_SDHCFRQ_POS)) /**< PCLK_DIV_SDHCFRQ Mask */
#define MXC_V_GCR_PCLK_DIV_SDHCFRQ_60M                 ((uint32_t)0x0UL) /**< PCLK_DIV_SDHCFRQ_60M Value */
#define MXC_S_GCR_PCLK_DIV_SDHCFRQ_60M                 (MXC_V_GCR_PCLK_DIV_SDHCFRQ_60M << MXC_F_GCR_PCLK_DIV_SDHCFRQ_POS) /**< PCLK_DIV_SDHCFRQ_60M Setting */
#define MXC_V_GCR_PCLK_DIV_SDHCFRQ_50M                 ((uint32_t)0x1UL) /**< PCLK_DIV_SDHCFRQ_50M Value */
#define MXC_S_GCR_PCLK_DIV_SDHCFRQ_50M                 (MXC_V_GCR_PCLK_DIV_SDHCFRQ_50M << MXC_F_GCR_PCLK_DIV_SDHCFRQ_POS) /**< PCLK_DIV_SDHCFRQ_50M Setting */

