analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/gcr_regs.h
#define MXC_F_GCR_PCLK_DIV_ADCFRQ_POS                  10 /**< PCLK_DIV_ADCFRQ Position */
#define MXC_F_GCR_PCLK_DIV_ADCFRQ                      ((uint32_t)(0xFUL << MXC_F_GCR_PCLK_DIV_ADCFRQ_POS)) /**< PCLK_DIV_ADCFRQ Mask */
#define MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV2                 ((uint32_t)0x2UL) /**< PCLK_DIV_ADCFRQ_DIV2 Value */
#define MXC_S_GCR_PCLK_DIV_ADCFRQ_DIV2                 (MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV2 << MXC_F_GCR_PCLK_DIV_ADCFRQ_POS) /**< PCLK_DIV_ADCFRQ_DIV2 Setting */
#define MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV3                 ((uint32_t)0x3UL) /**< PCLK_DIV_ADCFRQ_DIV3 Value */
#define MXC_S_GCR_PCLK_DIV_ADCFRQ_DIV3                 (MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV3 << MXC_F_GCR_PCLK_DIV_ADCFRQ_POS) /**< PCLK_DIV_ADCFRQ_DIV3 Setting */
#define MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV4                 ((uint32_t)0x4UL) /**< PCLK_DIV_ADCFRQ_DIV4 Value */
#define MXC_S_GCR_PCLK_DIV_ADCFRQ_DIV4                 (MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV4 << MXC_F_GCR_PCLK_DIV_ADCFRQ_POS) /**< PCLK_DIV_ADCFRQ_DIV4 Setting */
#define MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV5                 ((uint32_t)0x5UL) /**< PCLK_DIV_ADCFRQ_DIV5 Value */
#define MXC_S_GCR_PCLK_DIV_ADCFRQ_DIV5                 (MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV5 << MXC_F_GCR_PCLK_DIV_ADCFRQ_POS) /**< PCLK_DIV_ADCFRQ_DIV5 Setting */
#define MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV6                 ((uint32_t)0x6UL) /**< PCLK_DIV_ADCFRQ_DIV6 Value */
#define MXC_S_GCR_PCLK_DIV_ADCFRQ_DIV6                 (MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV6 << MXC_F_GCR_PCLK_DIV_ADCFRQ_POS) /**< PCLK_DIV_ADCFRQ_DIV6 Setting */
#define MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV7                 ((uint32_t)0x7UL) /**< PCLK_DIV_ADCFRQ_DIV7 Value */
#define MXC_S_GCR_PCLK_DIV_ADCFRQ_DIV7                 (MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV7 << MXC_F_GCR_PCLK_DIV_ADCFRQ_POS) /**< PCLK_DIV_ADCFRQ_DIV7 Setting */
#define MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV8                 ((uint32_t)0x8UL) /**< PCLK_DIV_ADCFRQ_DIV8 Value */
#define MXC_S_GCR_PCLK_DIV_ADCFRQ_DIV8                 (MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV8 << MXC_F_GCR_PCLK_DIV_ADCFRQ_POS) /**< PCLK_DIV_ADCFRQ_DIV8 Setting */
#define MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV9                 ((uint32_t)0x9UL) /**< PCLK_DIV_ADCFRQ_DIV9 Value */
#define MXC_S_GCR_PCLK_DIV_ADCFRQ_DIV9                 (MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV9 << MXC_F_GCR_PCLK_DIV_ADCFRQ_POS) /**< PCLK_DIV_ADCFRQ_DIV9 Setting */
#define MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV10                ((uint32_t)0xAUL) /**< PCLK_DIV_ADCFRQ_DIV10 Value */
#define MXC_S_GCR_PCLK_DIV_ADCFRQ_DIV10                (MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV10 << MXC_F_GCR_PCLK_DIV_ADCFRQ_POS) /**< PCLK_DIV_ADCFRQ_DIV10 Setting */
#define MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV11                ((uint32_t)0xBUL) /**< PCLK_DIV_ADCFRQ_DIV11 Value */
#define MXC_S_GCR_PCLK_DIV_ADCFRQ_DIV11                (MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV11 << MXC_F_GCR_PCLK_DIV_ADCFRQ_POS) /**< PCLK_DIV_ADCFRQ_DIV11 Setting */
#define MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV12                ((uint32_t)0xCUL) /**< PCLK_DIV_ADCFRQ_DIV12 Value */
#define MXC_S_GCR_PCLK_DIV_ADCFRQ_DIV12                (MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV12 << MXC_F_GCR_PCLK_DIV_ADCFRQ_POS) /**< PCLK_DIV_ADCFRQ_DIV12 Setting */
#define MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV13                ((uint32_t)0xDUL) /**< PCLK_DIV_ADCFRQ_DIV13 Value */
#define MXC_S_GCR_PCLK_DIV_ADCFRQ_DIV13                (MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV13 << MXC_F_GCR_PCLK_DIV_ADCFRQ_POS) /**< PCLK_DIV_ADCFRQ_DIV13 Setting */
#define MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV14                ((uint32_t)0xEUL) /**< PCLK_DIV_ADCFRQ_DIV14 Value */
#define MXC_S_GCR_PCLK_DIV_ADCFRQ_DIV14                (MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV14 << MXC_F_GCR_PCLK_DIV_ADCFRQ_POS) /**< PCLK_DIV_ADCFRQ_DIV14 Setting */
#define MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV15                ((uint32_t)0xFUL) /**< PCLK_DIV_ADCFRQ_DIV15 Value */
#define MXC_S_GCR_PCLK_DIV_ADCFRQ_DIV15                (MXC_V_GCR_PCLK_DIV_ADCFRQ_DIV15 << MXC_F_GCR_PCLK_DIV_ADCFRQ_POS) /**< PCLK_DIV_ADCFRQ_DIV15 Setting */

#define MXC_F_GCR_PCLK_DIV_AONDIV_POS                  14 /**< PCLK_DIV_AONDIV Position */
#define MXC_F_GCR_PCLK_DIV_AONDIV                      ((uint32_t)(0x3UL << MXC_F_GCR_PCLK_DIV_AONDIV_POS)) /**< PCLK_DIV_AONDIV Mask */
#define MXC_V_GCR_PCLK_DIV_AONDIV_DIV4                 ((uint32_t)0x0UL) /**< PCLK_DIV_AONDIV_DIV4 Value */
#define MXC_S_GCR_PCLK_DIV_AONDIV_DIV4                 (MXC_V_GCR_PCLK_DIV_AONDIV_DIV4 << MXC_F_GCR_PCLK_DIV_AONDIV_POS) /**< PCLK_DIV_AONDIV_DIV4 Setting */
#define MXC_V_GCR_PCLK_DIV_AONDIV_DIV8                 ((uint32_t)0x1UL) /**< PCLK_DIV_AONDIV_DIV8 Value */
#define MXC_S_GCR_PCLK_DIV_AONDIV_DIV8                 (MXC_V_GCR_PCLK_DIV_AONDIV_DIV8 << MXC_F_GCR_PCLK_DIV_AONDIV_POS) /**< PCLK_DIV_AONDIV_DIV8 Setting */
#define MXC_V_GCR_PCLK_DIV_AONDIV_DIV16                ((uint32_t)0x2UL) /**< PCLK_DIV_AONDIV_DIV16 Value */
#define MXC_S_GCR_PCLK_DIV_AONDIV_DIV16                (MXC_V_GCR_PCLK_DIV_AONDIV_DIV16 << MXC_F_GCR_PCLK_DIV_AONDIV_POS) /**< PCLK_DIV_AONDIV_DIV16 Setting */
#define MXC_V_GCR_PCLK_DIV_AONDIV_DIV32                ((uint32_t)0x3UL) /**< PCLK_DIV_AONDIV_DIV32 Value */
#define MXC_S_GCR_PCLK_DIV_AONDIV_DIV32                (MXC_V_GCR_PCLK_DIV_AONDIV_DIV32 << MXC_F_GCR_PCLK_DIV_AONDIV_POS) /**< PCLK_DIV_AONDIV_DIV32 Setting */

/**@} end of group GCR_PCLK_DIV_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_PCLK_DIS0 GCR_PCLK_DIS0
 * @brief    Peripheral Clock Disable.
 * @{
 */
#define MXC_F_GCR_PCLK_DIS0_GPIO0_POS                  0 /**< PCLK_DIS0_GPIO0 Position */
#define MXC_F_GCR_PCLK_DIS0_GPIO0                      ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_GPIO0_POS)) /**< PCLK_DIS0_GPIO0 Mask */
#define MXC_V_GCR_PCLK_DIS0_GPIO0_EN                   ((uint32_t)0x0UL) /**< PCLK_DIS0_GPIO0_EN Value */
#define MXC_S_GCR_PCLK_DIS0_GPIO0_EN                   (MXC_V_GCR_PCLK_DIS0_GPIO0_EN << MXC_F_GCR_PCLK_DIS0_GPIO0_POS) /**< PCLK_DIS0_GPIO0_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_GPIO0_DIS                  ((uint32_t)0x1UL) /**< PCLK_DIS0_GPIO0_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_GPIO0_DIS                  (MXC_V_GCR_PCLK_DIS0_GPIO0_DIS << MXC_F_GCR_PCLK_DIS0_GPIO0_POS) /**< PCLK_DIS0_GPIO0_DIS Setting */

