analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/gcr_regs.h
#define MXC_F_GCR_PCLK_DIS0_GPIO1_POS                  1 /**< PCLK_DIS0_GPIO1 Position */
#define MXC_F_GCR_PCLK_DIS0_GPIO1                      ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_GPIO1_POS)) /**< PCLK_DIS0_GPIO1 Mask */
#define MXC_V_GCR_PCLK_DIS0_GPIO1_EN                   ((uint32_t)0x0UL) /**< PCLK_DIS0_GPIO1_EN Value */
#define MXC_S_GCR_PCLK_DIS0_GPIO1_EN                   (MXC_V_GCR_PCLK_DIS0_GPIO1_EN << MXC_F_GCR_PCLK_DIS0_GPIO1_POS) /**< PCLK_DIS0_GPIO1_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_GPIO1_DIS                  ((uint32_t)0x1UL) /**< PCLK_DIS0_GPIO1_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_GPIO1_DIS                  (MXC_V_GCR_PCLK_DIS0_GPIO1_DIS << MXC_F_GCR_PCLK_DIS0_GPIO1_POS) /**< PCLK_DIS0_GPIO1_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_GPIO2_POS                  2 /**< PCLK_DIS0_GPIO2 Position */
#define MXC_F_GCR_PCLK_DIS0_GPIO2                      ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_GPIO2_POS)) /**< PCLK_DIS0_GPIO2 Mask */
#define MXC_V_GCR_PCLK_DIS0_GPIO2_EN                   ((uint32_t)0x0UL) /**< PCLK_DIS0_GPIO2_EN Value */
#define MXC_S_GCR_PCLK_DIS0_GPIO2_EN                   (MXC_V_GCR_PCLK_DIS0_GPIO2_EN << MXC_F_GCR_PCLK_DIS0_GPIO2_POS) /**< PCLK_DIS0_GPIO2_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_GPIO2_DIS                  ((uint32_t)0x1UL) /**< PCLK_DIS0_GPIO2_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_GPIO2_DIS                  (MXC_V_GCR_PCLK_DIS0_GPIO2_DIS << MXC_F_GCR_PCLK_DIS0_GPIO2_POS) /**< PCLK_DIS0_GPIO2_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_USB_POS                    3 /**< PCLK_DIS0_USB Position */
#define MXC_F_GCR_PCLK_DIS0_USB                        ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_USB_POS)) /**< PCLK_DIS0_USB Mask */
#define MXC_V_GCR_PCLK_DIS0_USB_EN                     ((uint32_t)0x0UL) /**< PCLK_DIS0_USB_EN Value */
#define MXC_S_GCR_PCLK_DIS0_USB_EN                     (MXC_V_GCR_PCLK_DIS0_USB_EN << MXC_F_GCR_PCLK_DIS0_USB_POS) /**< PCLK_DIS0_USB_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_USB_DIS                    ((uint32_t)0x1UL) /**< PCLK_DIS0_USB_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_USB_DIS                    (MXC_V_GCR_PCLK_DIS0_USB_DIS << MXC_F_GCR_PCLK_DIS0_USB_POS) /**< PCLK_DIS0_USB_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_TFT_POS                    4 /**< PCLK_DIS0_TFT Position */
#define MXC_F_GCR_PCLK_DIS0_TFT                        ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_TFT_POS)) /**< PCLK_DIS0_TFT Mask */
#define MXC_V_GCR_PCLK_DIS0_TFT_EN                     ((uint32_t)0x0UL) /**< PCLK_DIS0_TFT_EN Value */
#define MXC_S_GCR_PCLK_DIS0_TFT_EN                     (MXC_V_GCR_PCLK_DIS0_TFT_EN << MXC_F_GCR_PCLK_DIS0_TFT_POS) /**< PCLK_DIS0_TFT_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_TFT_DIS                    ((uint32_t)0x1UL) /**< PCLK_DIS0_TFT_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_TFT_DIS                    (MXC_V_GCR_PCLK_DIS0_TFT_DIS << MXC_F_GCR_PCLK_DIS0_TFT_POS) /**< PCLK_DIS0_TFT_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_DMA_POS                    5 /**< PCLK_DIS0_DMA Position */
#define MXC_F_GCR_PCLK_DIS0_DMA                        ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_DMA_POS)) /**< PCLK_DIS0_DMA Mask */
#define MXC_V_GCR_PCLK_DIS0_DMA_EN                     ((uint32_t)0x0UL) /**< PCLK_DIS0_DMA_EN Value */
#define MXC_S_GCR_PCLK_DIS0_DMA_EN                     (MXC_V_GCR_PCLK_DIS0_DMA_EN << MXC_F_GCR_PCLK_DIS0_DMA_POS) /**< PCLK_DIS0_DMA_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_DMA_DIS                    ((uint32_t)0x1UL) /**< PCLK_DIS0_DMA_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_DMA_DIS                    (MXC_V_GCR_PCLK_DIS0_DMA_DIS << MXC_F_GCR_PCLK_DIS0_DMA_POS) /**< PCLK_DIS0_DMA_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_SPI0_POS                   6 /**< PCLK_DIS0_SPI0 Position */
#define MXC_F_GCR_PCLK_DIS0_SPI0                       ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_SPI0_POS)) /**< PCLK_DIS0_SPI0 Mask */
#define MXC_V_GCR_PCLK_DIS0_SPI0_EN                    ((uint32_t)0x0UL) /**< PCLK_DIS0_SPI0_EN Value */
#define MXC_S_GCR_PCLK_DIS0_SPI0_EN                    (MXC_V_GCR_PCLK_DIS0_SPI0_EN << MXC_F_GCR_PCLK_DIS0_SPI0_POS) /**< PCLK_DIS0_SPI0_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_SPI0_DIS                   ((uint32_t)0x1UL) /**< PCLK_DIS0_SPI0_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_SPI0_DIS                   (MXC_V_GCR_PCLK_DIS0_SPI0_DIS << MXC_F_GCR_PCLK_DIS0_SPI0_POS) /**< PCLK_DIS0_SPI0_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_SPI1_POS                   7 /**< PCLK_DIS0_SPI1 Position */
#define MXC_F_GCR_PCLK_DIS0_SPI1                       ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_SPI1_POS)) /**< PCLK_DIS0_SPI1 Mask */
#define MXC_V_GCR_PCLK_DIS0_SPI1_EN                    ((uint32_t)0x0UL) /**< PCLK_DIS0_SPI1_EN Value */
#define MXC_S_GCR_PCLK_DIS0_SPI1_EN                    (MXC_V_GCR_PCLK_DIS0_SPI1_EN << MXC_F_GCR_PCLK_DIS0_SPI1_POS) /**< PCLK_DIS0_SPI1_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_SPI1_DIS                   ((uint32_t)0x1UL) /**< PCLK_DIS0_SPI1_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_SPI1_DIS                   (MXC_V_GCR_PCLK_DIS0_SPI1_DIS << MXC_F_GCR_PCLK_DIS0_SPI1_POS) /**< PCLK_DIS0_SPI1_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_SPI2_POS                   8 /**< PCLK_DIS0_SPI2 Position */
#define MXC_F_GCR_PCLK_DIS0_SPI2                       ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_SPI2_POS)) /**< PCLK_DIS0_SPI2 Mask */
#define MXC_V_GCR_PCLK_DIS0_SPI2_EN                    ((uint32_t)0x0UL) /**< PCLK_DIS0_SPI2_EN Value */
#define MXC_S_GCR_PCLK_DIS0_SPI2_EN                    (MXC_V_GCR_PCLK_DIS0_SPI2_EN << MXC_F_GCR_PCLK_DIS0_SPI2_POS) /**< PCLK_DIS0_SPI2_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_SPI2_DIS                   ((uint32_t)0x1UL) /**< PCLK_DIS0_SPI2_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_SPI2_DIS                   (MXC_V_GCR_PCLK_DIS0_SPI2_DIS << MXC_F_GCR_PCLK_DIS0_SPI2_POS) /**< PCLK_DIS0_SPI2_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_UART0_POS                  9 /**< PCLK_DIS0_UART0 Position */
#define MXC_F_GCR_PCLK_DIS0_UART0                      ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_UART0_POS)) /**< PCLK_DIS0_UART0 Mask */
#define MXC_V_GCR_PCLK_DIS0_UART0_EN                   ((uint32_t)0x0UL) /**< PCLK_DIS0_UART0_EN Value */
#define MXC_S_GCR_PCLK_DIS0_UART0_EN                   (MXC_V_GCR_PCLK_DIS0_UART0_EN << MXC_F_GCR_PCLK_DIS0_UART0_POS) /**< PCLK_DIS0_UART0_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_UART0_DIS                  ((uint32_t)0x1UL) /**< PCLK_DIS0_UART0_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_UART0_DIS                  (MXC_V_GCR_PCLK_DIS0_UART0_DIS << MXC_F_GCR_PCLK_DIS0_UART0_POS) /**< PCLK_DIS0_UART0_DIS Setting */

