analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/gcr_regs.h
#define MXC_F_GCR_PCLK_DIS0_UART1_POS                  10 /**< PCLK_DIS0_UART1 Position */
#define MXC_F_GCR_PCLK_DIS0_UART1                      ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_UART1_POS)) /**< PCLK_DIS0_UART1 Mask */
#define MXC_V_GCR_PCLK_DIS0_UART1_EN                   ((uint32_t)0x0UL) /**< PCLK_DIS0_UART1_EN Value */
#define MXC_S_GCR_PCLK_DIS0_UART1_EN                   (MXC_V_GCR_PCLK_DIS0_UART1_EN << MXC_F_GCR_PCLK_DIS0_UART1_POS) /**< PCLK_DIS0_UART1_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_UART1_DIS                  ((uint32_t)0x1UL) /**< PCLK_DIS0_UART1_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_UART1_DIS                  (MXC_V_GCR_PCLK_DIS0_UART1_DIS << MXC_F_GCR_PCLK_DIS0_UART1_POS) /**< PCLK_DIS0_UART1_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_I2C0_POS                   13 /**< PCLK_DIS0_I2C0 Position */
#define MXC_F_GCR_PCLK_DIS0_I2C0                       ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_I2C0_POS)) /**< PCLK_DIS0_I2C0 Mask */
#define MXC_V_GCR_PCLK_DIS0_I2C0_EN                    ((uint32_t)0x0UL) /**< PCLK_DIS0_I2C0_EN Value */
#define MXC_S_GCR_PCLK_DIS0_I2C0_EN                    (MXC_V_GCR_PCLK_DIS0_I2C0_EN << MXC_F_GCR_PCLK_DIS0_I2C0_POS) /**< PCLK_DIS0_I2C0_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_I2C0_DIS                   ((uint32_t)0x1UL) /**< PCLK_DIS0_I2C0_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_I2C0_DIS                   (MXC_V_GCR_PCLK_DIS0_I2C0_DIS << MXC_F_GCR_PCLK_DIS0_I2C0_POS) /**< PCLK_DIS0_I2C0_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_TPU_POS                    14 /**< PCLK_DIS0_TPU Position */
#define MXC_F_GCR_PCLK_DIS0_TPU                        ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_TPU_POS)) /**< PCLK_DIS0_TPU Mask */
#define MXC_V_GCR_PCLK_DIS0_TPU_EN                     ((uint32_t)0x0UL) /**< PCLK_DIS0_TPU_EN Value */
#define MXC_S_GCR_PCLK_DIS0_TPU_EN                     (MXC_V_GCR_PCLK_DIS0_TPU_EN << MXC_F_GCR_PCLK_DIS0_TPU_POS) /**< PCLK_DIS0_TPU_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_TPU_DIS                    ((uint32_t)0x1UL) /**< PCLK_DIS0_TPU_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_TPU_DIS                    (MXC_V_GCR_PCLK_DIS0_TPU_DIS << MXC_F_GCR_PCLK_DIS0_TPU_POS) /**< PCLK_DIS0_TPU_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_TIMER0_POS                 15 /**< PCLK_DIS0_TIMER0 Position */
#define MXC_F_GCR_PCLK_DIS0_TIMER0                     ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_TIMER0_POS)) /**< PCLK_DIS0_TIMER0 Mask */
#define MXC_V_GCR_PCLK_DIS0_TIMER0_EN                  ((uint32_t)0x0UL) /**< PCLK_DIS0_TIMER0_EN Value */
#define MXC_S_GCR_PCLK_DIS0_TIMER0_EN                  (MXC_V_GCR_PCLK_DIS0_TIMER0_EN << MXC_F_GCR_PCLK_DIS0_TIMER0_POS) /**< PCLK_DIS0_TIMER0_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_TIMER0_DIS                 ((uint32_t)0x1UL) /**< PCLK_DIS0_TIMER0_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_TIMER0_DIS                 (MXC_V_GCR_PCLK_DIS0_TIMER0_DIS << MXC_F_GCR_PCLK_DIS0_TIMER0_POS) /**< PCLK_DIS0_TIMER0_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_TIMER1_POS                 16 /**< PCLK_DIS0_TIMER1 Position */
#define MXC_F_GCR_PCLK_DIS0_TIMER1                     ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_TIMER1_POS)) /**< PCLK_DIS0_TIMER1 Mask */
#define MXC_V_GCR_PCLK_DIS0_TIMER1_EN                  ((uint32_t)0x0UL) /**< PCLK_DIS0_TIMER1_EN Value */
#define MXC_S_GCR_PCLK_DIS0_TIMER1_EN                  (MXC_V_GCR_PCLK_DIS0_TIMER1_EN << MXC_F_GCR_PCLK_DIS0_TIMER1_POS) /**< PCLK_DIS0_TIMER1_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_TIMER1_DIS                 ((uint32_t)0x1UL) /**< PCLK_DIS0_TIMER1_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_TIMER1_DIS                 (MXC_V_GCR_PCLK_DIS0_TIMER1_DIS << MXC_F_GCR_PCLK_DIS0_TIMER1_POS) /**< PCLK_DIS0_TIMER1_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_TIMER2_POS                 17 /**< PCLK_DIS0_TIMER2 Position */
#define MXC_F_GCR_PCLK_DIS0_TIMER2                     ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_TIMER2_POS)) /**< PCLK_DIS0_TIMER2 Mask */
#define MXC_V_GCR_PCLK_DIS0_TIMER2_EN                  ((uint32_t)0x0UL) /**< PCLK_DIS0_TIMER2_EN Value */
#define MXC_S_GCR_PCLK_DIS0_TIMER2_EN                  (MXC_V_GCR_PCLK_DIS0_TIMER2_EN << MXC_F_GCR_PCLK_DIS0_TIMER2_POS) /**< PCLK_DIS0_TIMER2_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_TIMER2_DIS                 ((uint32_t)0x1UL) /**< PCLK_DIS0_TIMER2_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_TIMER2_DIS                 (MXC_V_GCR_PCLK_DIS0_TIMER2_DIS << MXC_F_GCR_PCLK_DIS0_TIMER2_POS) /**< PCLK_DIS0_TIMER2_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_TIMER3_POS                 18 /**< PCLK_DIS0_TIMER3 Position */
#define MXC_F_GCR_PCLK_DIS0_TIMER3                     ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_TIMER3_POS)) /**< PCLK_DIS0_TIMER3 Mask */
#define MXC_V_GCR_PCLK_DIS0_TIMER3_EN                  ((uint32_t)0x0UL) /**< PCLK_DIS0_TIMER3_EN Value */
#define MXC_S_GCR_PCLK_DIS0_TIMER3_EN                  (MXC_V_GCR_PCLK_DIS0_TIMER3_EN << MXC_F_GCR_PCLK_DIS0_TIMER3_POS) /**< PCLK_DIS0_TIMER3_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_TIMER3_DIS                 ((uint32_t)0x1UL) /**< PCLK_DIS0_TIMER3_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_TIMER3_DIS                 (MXC_V_GCR_PCLK_DIS0_TIMER3_DIS << MXC_F_GCR_PCLK_DIS0_TIMER3_POS) /**< PCLK_DIS0_TIMER3_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_TIMER4_POS                 19 /**< PCLK_DIS0_TIMER4 Position */
#define MXC_F_GCR_PCLK_DIS0_TIMER4                     ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_TIMER4_POS)) /**< PCLK_DIS0_TIMER4 Mask */
#define MXC_V_GCR_PCLK_DIS0_TIMER4_EN                  ((uint32_t)0x0UL) /**< PCLK_DIS0_TIMER4_EN Value */
#define MXC_S_GCR_PCLK_DIS0_TIMER4_EN                  (MXC_V_GCR_PCLK_DIS0_TIMER4_EN << MXC_F_GCR_PCLK_DIS0_TIMER4_POS) /**< PCLK_DIS0_TIMER4_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_TIMER4_DIS                 ((uint32_t)0x1UL) /**< PCLK_DIS0_TIMER4_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_TIMER4_DIS                 (MXC_V_GCR_PCLK_DIS0_TIMER4_DIS << MXC_F_GCR_PCLK_DIS0_TIMER4_POS) /**< PCLK_DIS0_TIMER4_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_TIMER5_POS                 20 /**< PCLK_DIS0_TIMER5 Position */
#define MXC_F_GCR_PCLK_DIS0_TIMER5                     ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_TIMER5_POS)) /**< PCLK_DIS0_TIMER5 Mask */
#define MXC_V_GCR_PCLK_DIS0_TIMER5_EN                  ((uint32_t)0x0UL) /**< PCLK_DIS0_TIMER5_EN Value */
#define MXC_S_GCR_PCLK_DIS0_TIMER5_EN                  (MXC_V_GCR_PCLK_DIS0_TIMER5_EN << MXC_F_GCR_PCLK_DIS0_TIMER5_POS) /**< PCLK_DIS0_TIMER5_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_TIMER5_DIS                 ((uint32_t)0x1UL) /**< PCLK_DIS0_TIMER5_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_TIMER5_DIS                 (MXC_V_GCR_PCLK_DIS0_TIMER5_DIS << MXC_F_GCR_PCLK_DIS0_TIMER5_POS) /**< PCLK_DIS0_TIMER5_DIS Setting */

