analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/gcr_regs.h
#define MXC_F_GCR_PCLK_DIS0_ADC_POS                    23 /**< PCLK_DIS0_ADC Position */
#define MXC_F_GCR_PCLK_DIS0_ADC                        ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_ADC_POS)) /**< PCLK_DIS0_ADC Mask */
#define MXC_V_GCR_PCLK_DIS0_ADC_EN                     ((uint32_t)0x0UL) /**< PCLK_DIS0_ADC_EN Value */
#define MXC_S_GCR_PCLK_DIS0_ADC_EN                     (MXC_V_GCR_PCLK_DIS0_ADC_EN << MXC_F_GCR_PCLK_DIS0_ADC_POS) /**< PCLK_DIS0_ADC_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_ADC_DIS                    ((uint32_t)0x1UL) /**< PCLK_DIS0_ADC_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_ADC_DIS                    (MXC_V_GCR_PCLK_DIS0_ADC_DIS << MXC_F_GCR_PCLK_DIS0_ADC_POS) /**< PCLK_DIS0_ADC_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_I2C1_POS                   28 /**< PCLK_DIS0_I2C1 Position */
#define MXC_F_GCR_PCLK_DIS0_I2C1                       ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_I2C1_POS)) /**< PCLK_DIS0_I2C1 Mask */
#define MXC_V_GCR_PCLK_DIS0_I2C1_EN                    ((uint32_t)0x0UL) /**< PCLK_DIS0_I2C1_EN Value */
#define MXC_S_GCR_PCLK_DIS0_I2C1_EN                    (MXC_V_GCR_PCLK_DIS0_I2C1_EN << MXC_F_GCR_PCLK_DIS0_I2C1_POS) /**< PCLK_DIS0_I2C1_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_I2C1_DIS                   ((uint32_t)0x1UL) /**< PCLK_DIS0_I2C1_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_I2C1_DIS                   (MXC_V_GCR_PCLK_DIS0_I2C1_DIS << MXC_F_GCR_PCLK_DIS0_I2C1_POS) /**< PCLK_DIS0_I2C1_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_PT_POS                     29 /**< PCLK_DIS0_PT Position */
#define MXC_F_GCR_PCLK_DIS0_PT                         ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_PT_POS)) /**< PCLK_DIS0_PT Mask */
#define MXC_V_GCR_PCLK_DIS0_PT_EN                      ((uint32_t)0x0UL) /**< PCLK_DIS0_PT_EN Value */
#define MXC_S_GCR_PCLK_DIS0_PT_EN                      (MXC_V_GCR_PCLK_DIS0_PT_EN << MXC_F_GCR_PCLK_DIS0_PT_POS) /**< PCLK_DIS0_PT_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_PT_DIS                     ((uint32_t)0x1UL) /**< PCLK_DIS0_PT_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_PT_DIS                     (MXC_V_GCR_PCLK_DIS0_PT_DIS << MXC_F_GCR_PCLK_DIS0_PT_POS) /**< PCLK_DIS0_PT_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_SPIXIPF_POS                30 /**< PCLK_DIS0_SPIXIPF Position */
#define MXC_F_GCR_PCLK_DIS0_SPIXIPF                    ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_SPIXIPF_POS)) /**< PCLK_DIS0_SPIXIPF Mask */
#define MXC_V_GCR_PCLK_DIS0_SPIXIPF_EN                 ((uint32_t)0x0UL) /**< PCLK_DIS0_SPIXIPF_EN Value */
#define MXC_S_GCR_PCLK_DIS0_SPIXIPF_EN                 (MXC_V_GCR_PCLK_DIS0_SPIXIPF_EN << MXC_F_GCR_PCLK_DIS0_SPIXIPF_POS) /**< PCLK_DIS0_SPIXIPF_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_SPIXIPF_DIS                ((uint32_t)0x1UL) /**< PCLK_DIS0_SPIXIPF_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_SPIXIPF_DIS                (MXC_V_GCR_PCLK_DIS0_SPIXIPF_DIS << MXC_F_GCR_PCLK_DIS0_SPIXIPF_POS) /**< PCLK_DIS0_SPIXIPF_DIS Setting */

#define MXC_F_GCR_PCLK_DIS0_SPIXIPM_POS                31 /**< PCLK_DIS0_SPIXIPM Position */
#define MXC_F_GCR_PCLK_DIS0_SPIXIPM                    ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS0_SPIXIPM_POS)) /**< PCLK_DIS0_SPIXIPM Mask */
#define MXC_V_GCR_PCLK_DIS0_SPIXIPM_EN                 ((uint32_t)0x0UL) /**< PCLK_DIS0_SPIXIPM_EN Value */
#define MXC_S_GCR_PCLK_DIS0_SPIXIPM_EN                 (MXC_V_GCR_PCLK_DIS0_SPIXIPM_EN << MXC_F_GCR_PCLK_DIS0_SPIXIPM_POS) /**< PCLK_DIS0_SPIXIPM_EN Setting */
#define MXC_V_GCR_PCLK_DIS0_SPIXIPM_DIS                ((uint32_t)0x1UL) /**< PCLK_DIS0_SPIXIPM_DIS Value */
#define MXC_S_GCR_PCLK_DIS0_SPIXIPM_DIS                (MXC_V_GCR_PCLK_DIS0_SPIXIPM_DIS << MXC_F_GCR_PCLK_DIS0_SPIXIPM_POS) /**< PCLK_DIS0_SPIXIPM_DIS Setting */

/**@} end of group GCR_PCLK_DIS0_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_MEM_CLK GCR_MEM_CLK
 * @brief    Memory Clock Control Register.
 * @{
 */
#define MXC_F_GCR_MEM_CLK_FWS_POS                      0 /**< MEM_CLK_FWS Position */
#define MXC_F_GCR_MEM_CLK_FWS                          ((uint32_t)(0x7UL << MXC_F_GCR_MEM_CLK_FWS_POS)) /**< MEM_CLK_FWS Mask */

#define MXC_F_GCR_MEM_CLK_SYSRAM0LS_POS                16 /**< MEM_CLK_SYSRAM0LS Position */
#define MXC_F_GCR_MEM_CLK_SYSRAM0LS                    ((uint32_t)(0x1UL << MXC_F_GCR_MEM_CLK_SYSRAM0LS_POS)) /**< MEM_CLK_SYSRAM0LS Mask */
#define MXC_V_GCR_MEM_CLK_SYSRAM0LS_ACTIVE             ((uint32_t)0x0UL) /**< MEM_CLK_SYSRAM0LS_ACTIVE Value */
#define MXC_S_GCR_MEM_CLK_SYSRAM0LS_ACTIVE             (MXC_V_GCR_MEM_CLK_SYSRAM0LS_ACTIVE << MXC_F_GCR_MEM_CLK_SYSRAM0LS_POS) /**< MEM_CLK_SYSRAM0LS_ACTIVE Setting */
#define MXC_V_GCR_MEM_CLK_SYSRAM0LS_LIGHT_SLEEP        ((uint32_t)0x1UL) /**< MEM_CLK_SYSRAM0LS_LIGHT_SLEEP Value */
#define MXC_S_GCR_MEM_CLK_SYSRAM0LS_LIGHT_SLEEP        (MXC_V_GCR_MEM_CLK_SYSRAM0LS_LIGHT_SLEEP << MXC_F_GCR_MEM_CLK_SYSRAM0LS_POS) /**< MEM_CLK_SYSRAM0LS_LIGHT_SLEEP Setting */

#define MXC_F_GCR_MEM_CLK_SYSRAM1LS_POS                17 /**< MEM_CLK_SYSRAM1LS Position */
#define MXC_F_GCR_MEM_CLK_SYSRAM1LS                    ((uint32_t)(0x1UL << MXC_F_GCR_MEM_CLK_SYSRAM1LS_POS)) /**< MEM_CLK_SYSRAM1LS Mask */
#define MXC_V_GCR_MEM_CLK_SYSRAM1LS_ACTIVE             ((uint32_t)0x0UL) /**< MEM_CLK_SYSRAM1LS_ACTIVE Value */
#define MXC_S_GCR_MEM_CLK_SYSRAM1LS_ACTIVE             (MXC_V_GCR_MEM_CLK_SYSRAM1LS_ACTIVE << MXC_F_GCR_MEM_CLK_SYSRAM1LS_POS) /**< MEM_CLK_SYSRAM1LS_ACTIVE Setting */
#define MXC_V_GCR_MEM_CLK_SYSRAM1LS_LIGHT_SLEEP        ((uint32_t)0x1UL) /**< MEM_CLK_SYSRAM1LS_LIGHT_SLEEP Value */
#define MXC_S_GCR_MEM_CLK_SYSRAM1LS_LIGHT_SLEEP        (MXC_V_GCR_MEM_CLK_SYSRAM1LS_LIGHT_SLEEP << MXC_F_GCR_MEM_CLK_SYSRAM1LS_POS) /**< MEM_CLK_SYSRAM1LS_LIGHT_SLEEP Setting */

#define MXC_F_GCR_MEM_CLK_SYSRAM2LS_POS                18 /**< MEM_CLK_SYSRAM2LS Position */
#define MXC_F_GCR_MEM_CLK_SYSRAM2LS                    ((uint32_t)(0x1UL << MXC_F_GCR_MEM_CLK_SYSRAM2LS_POS)) /**< MEM_CLK_SYSRAM2LS Mask */
#define MXC_V_GCR_MEM_CLK_SYSRAM2LS_ACTIVE             ((uint32_t)0x0UL) /**< MEM_CLK_SYSRAM2LS_ACTIVE Value */
#define MXC_S_GCR_MEM_CLK_SYSRAM2LS_ACTIVE             (MXC_V_GCR_MEM_CLK_SYSRAM2LS_ACTIVE << MXC_F_GCR_MEM_CLK_SYSRAM2LS_POS) /**< MEM_CLK_SYSRAM2LS_ACTIVE Setting */
#define MXC_V_GCR_MEM_CLK_SYSRAM2LS_LIGHT_SLEEP        ((uint32_t)0x1UL) /**< MEM_CLK_SYSRAM2LS_LIGHT_SLEEP Value */
#define MXC_S_GCR_MEM_CLK_SYSRAM2LS_LIGHT_SLEEP        (MXC_V_GCR_MEM_CLK_SYSRAM2LS_LIGHT_SLEEP << MXC_F_GCR_MEM_CLK_SYSRAM2LS_POS) /**< MEM_CLK_SYSRAM2LS_LIGHT_SLEEP Setting */

#define MXC_F_GCR_MEM_CLK_SYSRAM3LS_POS                19 /**< MEM_CLK_SYSRAM3LS Position */
#define MXC_F_GCR_MEM_CLK_SYSRAM3LS                    ((uint32_t)(0x1UL << MXC_F_GCR_MEM_CLK_SYSRAM3LS_POS)) /**< MEM_CLK_SYSRAM3LS Mask */
#define MXC_V_GCR_MEM_CLK_SYSRAM3LS_ACTIVE             ((uint32_t)0x0UL) /**< MEM_CLK_SYSRAM3LS_ACTIVE Value */
#define MXC_S_GCR_MEM_CLK_SYSRAM3LS_ACTIVE             (MXC_V_GCR_MEM_CLK_SYSRAM3LS_ACTIVE << MXC_F_GCR_MEM_CLK_SYSRAM3LS_POS) /**< MEM_CLK_SYSRAM3LS_ACTIVE Setting */
#define MXC_V_GCR_MEM_CLK_SYSRAM3LS_LIGHT_SLEEP        ((uint32_t)0x1UL) /**< MEM_CLK_SYSRAM3LS_LIGHT_SLEEP Value */
#define MXC_S_GCR_MEM_CLK_SYSRAM3LS_LIGHT_SLEEP        (MXC_V_GCR_MEM_CLK_SYSRAM3LS_LIGHT_SLEEP << MXC_F_GCR_MEM_CLK_SYSRAM3LS_POS) /**< MEM_CLK_SYSRAM3LS_LIGHT_SLEEP Setting */

