analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/gcr_regs.h
#define MXC_F_GCR_MEM_CLK_SYSRAM4LS_POS                20 /**< MEM_CLK_SYSRAM4LS Position */
#define MXC_F_GCR_MEM_CLK_SYSRAM4LS                    ((uint32_t)(0x1UL << MXC_F_GCR_MEM_CLK_SYSRAM4LS_POS)) /**< MEM_CLK_SYSRAM4LS Mask */
#define MXC_V_GCR_MEM_CLK_SYSRAM4LS_ACTIVE             ((uint32_t)0x0UL) /**< MEM_CLK_SYSRAM4LS_ACTIVE Value */
#define MXC_S_GCR_MEM_CLK_SYSRAM4LS_ACTIVE             (MXC_V_GCR_MEM_CLK_SYSRAM4LS_ACTIVE << MXC_F_GCR_MEM_CLK_SYSRAM4LS_POS) /**< MEM_CLK_SYSRAM4LS_ACTIVE Setting */
#define MXC_V_GCR_MEM_CLK_SYSRAM4LS_LIGHT_SLEEP        ((uint32_t)0x1UL) /**< MEM_CLK_SYSRAM4LS_LIGHT_SLEEP Value */
#define MXC_S_GCR_MEM_CLK_SYSRAM4LS_LIGHT_SLEEP        (MXC_V_GCR_MEM_CLK_SYSRAM4LS_LIGHT_SLEEP << MXC_F_GCR_MEM_CLK_SYSRAM4LS_POS) /**< MEM_CLK_SYSRAM4LS_LIGHT_SLEEP Setting */

#define MXC_F_GCR_MEM_CLK_SYSRAM5LS_POS                21 /**< MEM_CLK_SYSRAM5LS Position */
#define MXC_F_GCR_MEM_CLK_SYSRAM5LS                    ((uint32_t)(0x1UL << MXC_F_GCR_MEM_CLK_SYSRAM5LS_POS)) /**< MEM_CLK_SYSRAM5LS Mask */
#define MXC_V_GCR_MEM_CLK_SYSRAM5LS_ACTIVE             ((uint32_t)0x0UL) /**< MEM_CLK_SYSRAM5LS_ACTIVE Value */
#define MXC_S_GCR_MEM_CLK_SYSRAM5LS_ACTIVE             (MXC_V_GCR_MEM_CLK_SYSRAM5LS_ACTIVE << MXC_F_GCR_MEM_CLK_SYSRAM5LS_POS) /**< MEM_CLK_SYSRAM5LS_ACTIVE Setting */
#define MXC_V_GCR_MEM_CLK_SYSRAM5LS_LIGHT_SLEEP        ((uint32_t)0x1UL) /**< MEM_CLK_SYSRAM5LS_LIGHT_SLEEP Value */
#define MXC_S_GCR_MEM_CLK_SYSRAM5LS_LIGHT_SLEEP        (MXC_V_GCR_MEM_CLK_SYSRAM5LS_LIGHT_SLEEP << MXC_F_GCR_MEM_CLK_SYSRAM5LS_POS) /**< MEM_CLK_SYSRAM5LS_LIGHT_SLEEP Setting */

#define MXC_F_GCR_MEM_CLK_SYSRAM6LS_POS                22 /**< MEM_CLK_SYSRAM6LS Position */
#define MXC_F_GCR_MEM_CLK_SYSRAM6LS                    ((uint32_t)(0x1UL << MXC_F_GCR_MEM_CLK_SYSRAM6LS_POS)) /**< MEM_CLK_SYSRAM6LS Mask */
#define MXC_V_GCR_MEM_CLK_SYSRAM6LS_ACTIVE             ((uint32_t)0x0UL) /**< MEM_CLK_SYSRAM6LS_ACTIVE Value */
#define MXC_S_GCR_MEM_CLK_SYSRAM6LS_ACTIVE             (MXC_V_GCR_MEM_CLK_SYSRAM6LS_ACTIVE << MXC_F_GCR_MEM_CLK_SYSRAM6LS_POS) /**< MEM_CLK_SYSRAM6LS_ACTIVE Setting */
#define MXC_V_GCR_MEM_CLK_SYSRAM6LS_LIGHT_SLEEP        ((uint32_t)0x1UL) /**< MEM_CLK_SYSRAM6LS_LIGHT_SLEEP Value */
#define MXC_S_GCR_MEM_CLK_SYSRAM6LS_LIGHT_SLEEP        (MXC_V_GCR_MEM_CLK_SYSRAM6LS_LIGHT_SLEEP << MXC_F_GCR_MEM_CLK_SYSRAM6LS_POS) /**< MEM_CLK_SYSRAM6LS_LIGHT_SLEEP Setting */

#define MXC_F_GCR_MEM_CLK_ICACHELS_POS                 24 /**< MEM_CLK_ICACHELS Position */
#define MXC_F_GCR_MEM_CLK_ICACHELS                     ((uint32_t)(0x1UL << MXC_F_GCR_MEM_CLK_ICACHELS_POS)) /**< MEM_CLK_ICACHELS Mask */
#define MXC_V_GCR_MEM_CLK_ICACHELS_ACTIVE              ((uint32_t)0x0UL) /**< MEM_CLK_ICACHELS_ACTIVE Value */
#define MXC_S_GCR_MEM_CLK_ICACHELS_ACTIVE              (MXC_V_GCR_MEM_CLK_ICACHELS_ACTIVE << MXC_F_GCR_MEM_CLK_ICACHELS_POS) /**< MEM_CLK_ICACHELS_ACTIVE Setting */
#define MXC_V_GCR_MEM_CLK_ICACHELS_LIGHT_SLEEP         ((uint32_t)0x1UL) /**< MEM_CLK_ICACHELS_LIGHT_SLEEP Value */
#define MXC_S_GCR_MEM_CLK_ICACHELS_LIGHT_SLEEP         (MXC_V_GCR_MEM_CLK_ICACHELS_LIGHT_SLEEP << MXC_F_GCR_MEM_CLK_ICACHELS_POS) /**< MEM_CLK_ICACHELS_LIGHT_SLEEP Setting */

#define MXC_F_GCR_MEM_CLK_ICACHEXIPLS_POS              25 /**< MEM_CLK_ICACHEXIPLS Position */
#define MXC_F_GCR_MEM_CLK_ICACHEXIPLS                  ((uint32_t)(0x1UL << MXC_F_GCR_MEM_CLK_ICACHEXIPLS_POS)) /**< MEM_CLK_ICACHEXIPLS Mask */
#define MXC_V_GCR_MEM_CLK_ICACHEXIPLS_ACTIVE           ((uint32_t)0x0UL) /**< MEM_CLK_ICACHEXIPLS_ACTIVE Value */
#define MXC_S_GCR_MEM_CLK_ICACHEXIPLS_ACTIVE           (MXC_V_GCR_MEM_CLK_ICACHEXIPLS_ACTIVE << MXC_F_GCR_MEM_CLK_ICACHEXIPLS_POS) /**< MEM_CLK_ICACHEXIPLS_ACTIVE Setting */
#define MXC_V_GCR_MEM_CLK_ICACHEXIPLS_LIGHT_SLEEP      ((uint32_t)0x1UL) /**< MEM_CLK_ICACHEXIPLS_LIGHT_SLEEP Value */
#define MXC_S_GCR_MEM_CLK_ICACHEXIPLS_LIGHT_SLEEP      (MXC_V_GCR_MEM_CLK_ICACHEXIPLS_LIGHT_SLEEP << MXC_F_GCR_MEM_CLK_ICACHEXIPLS_POS) /**< MEM_CLK_ICACHEXIPLS_LIGHT_SLEEP Setting */

#define MXC_F_GCR_MEM_CLK_SCACHELS_POS                 26 /**< MEM_CLK_SCACHELS Position */
#define MXC_F_GCR_MEM_CLK_SCACHELS                     ((uint32_t)(0x1UL << MXC_F_GCR_MEM_CLK_SCACHELS_POS)) /**< MEM_CLK_SCACHELS Mask */
#define MXC_V_GCR_MEM_CLK_SCACHELS_ACTIVE              ((uint32_t)0x0UL) /**< MEM_CLK_SCACHELS_ACTIVE Value */
#define MXC_S_GCR_MEM_CLK_SCACHELS_ACTIVE              (MXC_V_GCR_MEM_CLK_SCACHELS_ACTIVE << MXC_F_GCR_MEM_CLK_SCACHELS_POS) /**< MEM_CLK_SCACHELS_ACTIVE Setting */
#define MXC_V_GCR_MEM_CLK_SCACHELS_LIGHT_SLEEP         ((uint32_t)0x1UL) /**< MEM_CLK_SCACHELS_LIGHT_SLEEP Value */
#define MXC_S_GCR_MEM_CLK_SCACHELS_LIGHT_SLEEP         (MXC_V_GCR_MEM_CLK_SCACHELS_LIGHT_SLEEP << MXC_F_GCR_MEM_CLK_SCACHELS_POS) /**< MEM_CLK_SCACHELS_LIGHT_SLEEP Setting */

#define MXC_F_GCR_MEM_CLK_CRYPTOLS_POS                 27 /**< MEM_CLK_CRYPTOLS Position */
#define MXC_F_GCR_MEM_CLK_CRYPTOLS                     ((uint32_t)(0x1UL << MXC_F_GCR_MEM_CLK_CRYPTOLS_POS)) /**< MEM_CLK_CRYPTOLS Mask */
#define MXC_V_GCR_MEM_CLK_CRYPTOLS_ACTIVE              ((uint32_t)0x0UL) /**< MEM_CLK_CRYPTOLS_ACTIVE Value */
#define MXC_S_GCR_MEM_CLK_CRYPTOLS_ACTIVE              (MXC_V_GCR_MEM_CLK_CRYPTOLS_ACTIVE << MXC_F_GCR_MEM_CLK_CRYPTOLS_POS) /**< MEM_CLK_CRYPTOLS_ACTIVE Setting */
#define MXC_V_GCR_MEM_CLK_CRYPTOLS_LIGHT_SLEEP         ((uint32_t)0x1UL) /**< MEM_CLK_CRYPTOLS_LIGHT_SLEEP Value */
#define MXC_S_GCR_MEM_CLK_CRYPTOLS_LIGHT_SLEEP         (MXC_V_GCR_MEM_CLK_CRYPTOLS_LIGHT_SLEEP << MXC_F_GCR_MEM_CLK_CRYPTOLS_POS) /**< MEM_CLK_CRYPTOLS_LIGHT_SLEEP Setting */

#define MXC_F_GCR_MEM_CLK_USBLS_POS                    28 /**< MEM_CLK_USBLS Position */
#define MXC_F_GCR_MEM_CLK_USBLS                        ((uint32_t)(0x1UL << MXC_F_GCR_MEM_CLK_USBLS_POS)) /**< MEM_CLK_USBLS Mask */
#define MXC_V_GCR_MEM_CLK_USBLS_ACTIVE                 ((uint32_t)0x0UL) /**< MEM_CLK_USBLS_ACTIVE Value */
#define MXC_S_GCR_MEM_CLK_USBLS_ACTIVE                 (MXC_V_GCR_MEM_CLK_USBLS_ACTIVE << MXC_F_GCR_MEM_CLK_USBLS_POS) /**< MEM_CLK_USBLS_ACTIVE Setting */
#define MXC_V_GCR_MEM_CLK_USBLS_LIGHT_SLEEP            ((uint32_t)0x1UL) /**< MEM_CLK_USBLS_LIGHT_SLEEP Value */
#define MXC_S_GCR_MEM_CLK_USBLS_LIGHT_SLEEP            (MXC_V_GCR_MEM_CLK_USBLS_LIGHT_SLEEP << MXC_F_GCR_MEM_CLK_USBLS_POS) /**< MEM_CLK_USBLS_LIGHT_SLEEP Setting */

#define MXC_F_GCR_MEM_CLK_ROMLS_POS                    29 /**< MEM_CLK_ROMLS Position */
#define MXC_F_GCR_MEM_CLK_ROMLS                        ((uint32_t)(0x1UL << MXC_F_GCR_MEM_CLK_ROMLS_POS)) /**< MEM_CLK_ROMLS Mask */
#define MXC_V_GCR_MEM_CLK_ROMLS_ACTIVE                 ((uint32_t)0x0UL) /**< MEM_CLK_ROMLS_ACTIVE Value */
#define MXC_S_GCR_MEM_CLK_ROMLS_ACTIVE                 (MXC_V_GCR_MEM_CLK_ROMLS_ACTIVE << MXC_F_GCR_MEM_CLK_ROMLS_POS) /**< MEM_CLK_ROMLS_ACTIVE Setting */
#define MXC_V_GCR_MEM_CLK_ROMLS_LIGHT_SLEEP            ((uint32_t)0x1UL) /**< MEM_CLK_ROMLS_LIGHT_SLEEP Value */
#define MXC_S_GCR_MEM_CLK_ROMLS_LIGHT_SLEEP            (MXC_V_GCR_MEM_CLK_ROMLS_LIGHT_SLEEP << MXC_F_GCR_MEM_CLK_ROMLS_POS) /**< MEM_CLK_ROMLS_LIGHT_SLEEP Setting */

/**@} end of group GCR_MEM_CLK_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_MEM_ZERO GCR_MEM_ZERO
 * @brief    Memory Zeroize Control.
 * @{
 */
#define MXC_F_GCR_MEM_ZERO_SRAM0Z_POS                  0 /**< MEM_ZERO_SRAM0Z Position */
#define MXC_F_GCR_MEM_ZERO_SRAM0Z                      ((uint32_t)(0x1UL << MXC_F_GCR_MEM_ZERO_SRAM0Z_POS)) /**< MEM_ZERO_SRAM0Z Mask */
#define MXC_V_GCR_MEM_ZERO_SRAM0Z_NOP                  ((uint32_t)0x0UL) /**< MEM_ZERO_SRAM0Z_NOP Value */
#define MXC_S_GCR_MEM_ZERO_SRAM0Z_NOP                  (MXC_V_GCR_MEM_ZERO_SRAM0Z_NOP << MXC_F_GCR_MEM_ZERO_SRAM0Z_POS) /**< MEM_ZERO_SRAM0Z_NOP Setting */
#define MXC_V_GCR_MEM_ZERO_SRAM0Z_START                ((uint32_t)0x1UL) /**< MEM_ZERO_SRAM0Z_START Value */
#define MXC_S_GCR_MEM_ZERO_SRAM0Z_START                (MXC_V_GCR_MEM_ZERO_SRAM0Z_START << MXC_F_GCR_MEM_ZERO_SRAM0Z_POS) /**< MEM_ZERO_SRAM0Z_START Setting */

#define MXC_F_GCR_MEM_ZERO_SRAM1Z_POS                  1 /**< MEM_ZERO_SRAM1Z Position */
#define MXC_F_GCR_MEM_ZERO_SRAM1Z                      ((uint32_t)(0x1UL << MXC_F_GCR_MEM_ZERO_SRAM1Z_POS)) /**< MEM_ZERO_SRAM1Z Mask */
#define MXC_V_GCR_MEM_ZERO_SRAM1Z_NOP                  ((uint32_t)0x0UL) /**< MEM_ZERO_SRAM1Z_NOP Value */
#define MXC_S_GCR_MEM_ZERO_SRAM1Z_NOP                  (MXC_V_GCR_MEM_ZERO_SRAM1Z_NOP << MXC_F_GCR_MEM_ZERO_SRAM1Z_POS) /**< MEM_ZERO_SRAM1Z_NOP Setting */
#define MXC_V_GCR_MEM_ZERO_SRAM1Z_START                ((uint32_t)0x1UL) /**< MEM_ZERO_SRAM1Z_START Value */
#define MXC_S_GCR_MEM_ZERO_SRAM1Z_START                (MXC_V_GCR_MEM_ZERO_SRAM1Z_START << MXC_F_GCR_MEM_ZERO_SRAM1Z_POS) /**< MEM_ZERO_SRAM1Z_START Setting */

#define MXC_F_GCR_MEM_ZERO_SRAM2Z_POS                  2 /**< MEM_ZERO_SRAM2Z Position */
#define MXC_F_GCR_MEM_ZERO_SRAM2Z                      ((uint32_t)(0x1UL << MXC_F_GCR_MEM_ZERO_SRAM2Z_POS)) /**< MEM_ZERO_SRAM2Z Mask */
#define MXC_V_GCR_MEM_ZERO_SRAM2Z_NOP                  ((uint32_t)0x0UL) /**< MEM_ZERO_SRAM2Z_NOP Value */
#define MXC_S_GCR_MEM_ZERO_SRAM2Z_NOP                  (MXC_V_GCR_MEM_ZERO_SRAM2Z_NOP << MXC_F_GCR_MEM_ZERO_SRAM2Z_POS) /**< MEM_ZERO_SRAM2Z_NOP Setting */
#define MXC_V_GCR_MEM_ZERO_SRAM2Z_START                ((uint32_t)0x1UL) /**< MEM_ZERO_SRAM2Z_START Value */
#define MXC_S_GCR_MEM_ZERO_SRAM2Z_START                (MXC_V_GCR_MEM_ZERO_SRAM2Z_START << MXC_F_GCR_MEM_ZERO_SRAM2Z_POS) /**< MEM_ZERO_SRAM2Z_START Setting */

#define MXC_F_GCR_MEM_ZERO_SRAM3Z_POS                  3 /**< MEM_ZERO_SRAM3Z Position */
#define MXC_F_GCR_MEM_ZERO_SRAM3Z                      ((uint32_t)(0x1UL << MXC_F_GCR_MEM_ZERO_SRAM3Z_POS)) /**< MEM_ZERO_SRAM3Z Mask */
#define MXC_V_GCR_MEM_ZERO_SRAM3Z_NOP                  ((uint32_t)0x0UL) /**< MEM_ZERO_SRAM3Z_NOP Value */
#define MXC_S_GCR_MEM_ZERO_SRAM3Z_NOP                  (MXC_V_GCR_MEM_ZERO_SRAM3Z_NOP << MXC_F_GCR_MEM_ZERO_SRAM3Z_POS) /**< MEM_ZERO_SRAM3Z_NOP Setting */
#define MXC_V_GCR_MEM_ZERO_SRAM3Z_START                ((uint32_t)0x1UL) /**< MEM_ZERO_SRAM3Z_START Value */
#define MXC_S_GCR_MEM_ZERO_SRAM3Z_START                (MXC_V_GCR_MEM_ZERO_SRAM3Z_START << MXC_F_GCR_MEM_ZERO_SRAM3Z_POS) /**< MEM_ZERO_SRAM3Z_START Setting */

#define MXC_F_GCR_MEM_ZERO_SRAM4Z_POS                  4 /**< MEM_ZERO_SRAM4Z Position */
#define MXC_F_GCR_MEM_ZERO_SRAM4Z                      ((uint32_t)(0x1UL << MXC_F_GCR_MEM_ZERO_SRAM4Z_POS)) /**< MEM_ZERO_SRAM4Z Mask */
#define MXC_V_GCR_MEM_ZERO_SRAM4Z_NOP                  ((uint32_t)0x0UL) /**< MEM_ZERO_SRAM4Z_NOP Value */
#define MXC_S_GCR_MEM_ZERO_SRAM4Z_NOP                  (MXC_V_GCR_MEM_ZERO_SRAM4Z_NOP << MXC_F_GCR_MEM_ZERO_SRAM4Z_POS) /**< MEM_ZERO_SRAM4Z_NOP Setting */
#define MXC_V_GCR_MEM_ZERO_SRAM4Z_START                ((uint32_t)0x1UL) /**< MEM_ZERO_SRAM4Z_START Value */
#define MXC_S_GCR_MEM_ZERO_SRAM4Z_START                (MXC_V_GCR_MEM_ZERO_SRAM4Z_START << MXC_F_GCR_MEM_ZERO_SRAM4Z_POS) /**< MEM_ZERO_SRAM4Z_START Setting */

