analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/gcr_regs.h
#define MXC_F_GCR_MEM_ZERO_SRAM5Z_POS                  5 /**< MEM_ZERO_SRAM5Z Position */
#define MXC_F_GCR_MEM_ZERO_SRAM5Z                      ((uint32_t)(0x1UL << MXC_F_GCR_MEM_ZERO_SRAM5Z_POS)) /**< MEM_ZERO_SRAM5Z Mask */
#define MXC_V_GCR_MEM_ZERO_SRAM5Z_NOP                  ((uint32_t)0x0UL) /**< MEM_ZERO_SRAM5Z_NOP Value */
#define MXC_S_GCR_MEM_ZERO_SRAM5Z_NOP                  (MXC_V_GCR_MEM_ZERO_SRAM5Z_NOP << MXC_F_GCR_MEM_ZERO_SRAM5Z_POS) /**< MEM_ZERO_SRAM5Z_NOP Setting */
#define MXC_V_GCR_MEM_ZERO_SRAM5Z_START                ((uint32_t)0x1UL) /**< MEM_ZERO_SRAM5Z_START Value */
#define MXC_S_GCR_MEM_ZERO_SRAM5Z_START                (MXC_V_GCR_MEM_ZERO_SRAM5Z_START << MXC_F_GCR_MEM_ZERO_SRAM5Z_POS) /**< MEM_ZERO_SRAM5Z_START Setting */

#define MXC_F_GCR_MEM_ZERO_SRAM6Z_POS                  6 /**< MEM_ZERO_SRAM6Z Position */
#define MXC_F_GCR_MEM_ZERO_SRAM6Z                      ((uint32_t)(0x1UL << MXC_F_GCR_MEM_ZERO_SRAM6Z_POS)) /**< MEM_ZERO_SRAM6Z Mask */
#define MXC_V_GCR_MEM_ZERO_SRAM6Z_NOP                  ((uint32_t)0x0UL) /**< MEM_ZERO_SRAM6Z_NOP Value */
#define MXC_S_GCR_MEM_ZERO_SRAM6Z_NOP                  (MXC_V_GCR_MEM_ZERO_SRAM6Z_NOP << MXC_F_GCR_MEM_ZERO_SRAM6Z_POS) /**< MEM_ZERO_SRAM6Z_NOP Setting */
#define MXC_V_GCR_MEM_ZERO_SRAM6Z_START                ((uint32_t)0x1UL) /**< MEM_ZERO_SRAM6Z_START Value */
#define MXC_S_GCR_MEM_ZERO_SRAM6Z_START                (MXC_V_GCR_MEM_ZERO_SRAM6Z_START << MXC_F_GCR_MEM_ZERO_SRAM6Z_POS) /**< MEM_ZERO_SRAM6Z_START Setting */

#define MXC_F_GCR_MEM_ZERO_ICACHEZ_POS                 8 /**< MEM_ZERO_ICACHEZ Position */
#define MXC_F_GCR_MEM_ZERO_ICACHEZ                     ((uint32_t)(0x1UL << MXC_F_GCR_MEM_ZERO_ICACHEZ_POS)) /**< MEM_ZERO_ICACHEZ Mask */
#define MXC_V_GCR_MEM_ZERO_ICACHEZ_NOP                 ((uint32_t)0x0UL) /**< MEM_ZERO_ICACHEZ_NOP Value */
#define MXC_S_GCR_MEM_ZERO_ICACHEZ_NOP                 (MXC_V_GCR_MEM_ZERO_ICACHEZ_NOP << MXC_F_GCR_MEM_ZERO_ICACHEZ_POS) /**< MEM_ZERO_ICACHEZ_NOP Setting */
#define MXC_V_GCR_MEM_ZERO_ICACHEZ_START               ((uint32_t)0x1UL) /**< MEM_ZERO_ICACHEZ_START Value */
#define MXC_S_GCR_MEM_ZERO_ICACHEZ_START               (MXC_V_GCR_MEM_ZERO_ICACHEZ_START << MXC_F_GCR_MEM_ZERO_ICACHEZ_POS) /**< MEM_ZERO_ICACHEZ_START Setting */

#define MXC_F_GCR_MEM_ZERO_ICACHEXIPZ_POS              9 /**< MEM_ZERO_ICACHEXIPZ Position */
#define MXC_F_GCR_MEM_ZERO_ICACHEXIPZ                  ((uint32_t)(0x1UL << MXC_F_GCR_MEM_ZERO_ICACHEXIPZ_POS)) /**< MEM_ZERO_ICACHEXIPZ Mask */
#define MXC_V_GCR_MEM_ZERO_ICACHEXIPZ_NOP              ((uint32_t)0x0UL) /**< MEM_ZERO_ICACHEXIPZ_NOP Value */
#define MXC_S_GCR_MEM_ZERO_ICACHEXIPZ_NOP              (MXC_V_GCR_MEM_ZERO_ICACHEXIPZ_NOP << MXC_F_GCR_MEM_ZERO_ICACHEXIPZ_POS) /**< MEM_ZERO_ICACHEXIPZ_NOP Setting */
#define MXC_V_GCR_MEM_ZERO_ICACHEXIPZ_START            ((uint32_t)0x1UL) /**< MEM_ZERO_ICACHEXIPZ_START Value */
#define MXC_S_GCR_MEM_ZERO_ICACHEXIPZ_START            (MXC_V_GCR_MEM_ZERO_ICACHEXIPZ_START << MXC_F_GCR_MEM_ZERO_ICACHEXIPZ_POS) /**< MEM_ZERO_ICACHEXIPZ_START Setting */

#define MXC_F_GCR_MEM_ZERO_SCACHEDATAZ_POS             10 /**< MEM_ZERO_SCACHEDATAZ Position */
#define MXC_F_GCR_MEM_ZERO_SCACHEDATAZ                 ((uint32_t)(0x1UL << MXC_F_GCR_MEM_ZERO_SCACHEDATAZ_POS)) /**< MEM_ZERO_SCACHEDATAZ Mask */
#define MXC_V_GCR_MEM_ZERO_SCACHEDATAZ_NOP             ((uint32_t)0x0UL) /**< MEM_ZERO_SCACHEDATAZ_NOP Value */
#define MXC_S_GCR_MEM_ZERO_SCACHEDATAZ_NOP             (MXC_V_GCR_MEM_ZERO_SCACHEDATAZ_NOP << MXC_F_GCR_MEM_ZERO_SCACHEDATAZ_POS) /**< MEM_ZERO_SCACHEDATAZ_NOP Setting */
#define MXC_V_GCR_MEM_ZERO_SCACHEDATAZ_START           ((uint32_t)0x1UL) /**< MEM_ZERO_SCACHEDATAZ_START Value */
#define MXC_S_GCR_MEM_ZERO_SCACHEDATAZ_START           (MXC_V_GCR_MEM_ZERO_SCACHEDATAZ_START << MXC_F_GCR_MEM_ZERO_SCACHEDATAZ_POS) /**< MEM_ZERO_SCACHEDATAZ_START Setting */

#define MXC_F_GCR_MEM_ZERO_SCACHETAGZ_POS              11 /**< MEM_ZERO_SCACHETAGZ Position */
#define MXC_F_GCR_MEM_ZERO_SCACHETAGZ                  ((uint32_t)(0x1UL << MXC_F_GCR_MEM_ZERO_SCACHETAGZ_POS)) /**< MEM_ZERO_SCACHETAGZ Mask */
#define MXC_V_GCR_MEM_ZERO_SCACHETAGZ_NOP              ((uint32_t)0x0UL) /**< MEM_ZERO_SCACHETAGZ_NOP Value */
#define MXC_S_GCR_MEM_ZERO_SCACHETAGZ_NOP              (MXC_V_GCR_MEM_ZERO_SCACHETAGZ_NOP << MXC_F_GCR_MEM_ZERO_SCACHETAGZ_POS) /**< MEM_ZERO_SCACHETAGZ_NOP Setting */
#define MXC_V_GCR_MEM_ZERO_SCACHETAGZ_START            ((uint32_t)0x1UL) /**< MEM_ZERO_SCACHETAGZ_START Value */
#define MXC_S_GCR_MEM_ZERO_SCACHETAGZ_START            (MXC_V_GCR_MEM_ZERO_SCACHETAGZ_START << MXC_F_GCR_MEM_ZERO_SCACHETAGZ_POS) /**< MEM_ZERO_SCACHETAGZ_START Setting */

#define MXC_F_GCR_MEM_ZERO_CRYPTOZ_POS                 12 /**< MEM_ZERO_CRYPTOZ Position */
#define MXC_F_GCR_MEM_ZERO_CRYPTOZ                     ((uint32_t)(0x1UL << MXC_F_GCR_MEM_ZERO_CRYPTOZ_POS)) /**< MEM_ZERO_CRYPTOZ Mask */
#define MXC_V_GCR_MEM_ZERO_CRYPTOZ_NOP                 ((uint32_t)0x0UL) /**< MEM_ZERO_CRYPTOZ_NOP Value */
#define MXC_S_GCR_MEM_ZERO_CRYPTOZ_NOP                 (MXC_V_GCR_MEM_ZERO_CRYPTOZ_NOP << MXC_F_GCR_MEM_ZERO_CRYPTOZ_POS) /**< MEM_ZERO_CRYPTOZ_NOP Setting */
#define MXC_V_GCR_MEM_ZERO_CRYPTOZ_START               ((uint32_t)0x1UL) /**< MEM_ZERO_CRYPTOZ_START Value */
#define MXC_S_GCR_MEM_ZERO_CRYPTOZ_START               (MXC_V_GCR_MEM_ZERO_CRYPTOZ_START << MXC_F_GCR_MEM_ZERO_CRYPTOZ_POS) /**< MEM_ZERO_CRYPTOZ_START Setting */

#define MXC_F_GCR_MEM_ZERO_USBFIFOZ_POS                13 /**< MEM_ZERO_USBFIFOZ Position */
#define MXC_F_GCR_MEM_ZERO_USBFIFOZ                    ((uint32_t)(0x1UL << MXC_F_GCR_MEM_ZERO_USBFIFOZ_POS)) /**< MEM_ZERO_USBFIFOZ Mask */
#define MXC_V_GCR_MEM_ZERO_USBFIFOZ_NOP                ((uint32_t)0x0UL) /**< MEM_ZERO_USBFIFOZ_NOP Value */
#define MXC_S_GCR_MEM_ZERO_USBFIFOZ_NOP                (MXC_V_GCR_MEM_ZERO_USBFIFOZ_NOP << MXC_F_GCR_MEM_ZERO_USBFIFOZ_POS) /**< MEM_ZERO_USBFIFOZ_NOP Setting */
#define MXC_V_GCR_MEM_ZERO_USBFIFOZ_START              ((uint32_t)0x1UL) /**< MEM_ZERO_USBFIFOZ_START Value */
#define MXC_S_GCR_MEM_ZERO_USBFIFOZ_START              (MXC_V_GCR_MEM_ZERO_USBFIFOZ_START << MXC_F_GCR_MEM_ZERO_USBFIFOZ_POS) /**< MEM_ZERO_USBFIFOZ_START Setting */

