analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/gcr_regs.h
/**@} end of group GCR_MEM_ZERO_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_SYS_STAT GCR_SYS_STAT
 * @brief    System Status Register.
 * @{
 */
#define MXC_F_GCR_SYS_STAT_ICELOCK_POS                 0 /**< SYS_STAT_ICELOCK Position */
#define MXC_F_GCR_SYS_STAT_ICELOCK                     ((uint32_t)(0x1UL << MXC_F_GCR_SYS_STAT_ICELOCK_POS)) /**< SYS_STAT_ICELOCK Mask */
#define MXC_V_GCR_SYS_STAT_ICELOCK_UNLOCKED            ((uint32_t)0x0UL) /**< SYS_STAT_ICELOCK_UNLOCKED Value */
#define MXC_S_GCR_SYS_STAT_ICELOCK_UNLOCKED            (MXC_V_GCR_SYS_STAT_ICELOCK_UNLOCKED << MXC_F_GCR_SYS_STAT_ICELOCK_POS) /**< SYS_STAT_ICELOCK_UNLOCKED Setting */
#define MXC_V_GCR_SYS_STAT_ICELOCK_LOCKED              ((uint32_t)0x1UL) /**< SYS_STAT_ICELOCK_LOCKED Value */
#define MXC_S_GCR_SYS_STAT_ICELOCK_LOCKED              (MXC_V_GCR_SYS_STAT_ICELOCK_LOCKED << MXC_F_GCR_SYS_STAT_ICELOCK_POS) /**< SYS_STAT_ICELOCK_LOCKED Setting */

#define MXC_F_GCR_SYS_STAT_CODEINTERR_POS              1 /**< SYS_STAT_CODEINTERR Position */
#define MXC_F_GCR_SYS_STAT_CODEINTERR                  ((uint32_t)(0x1UL << MXC_F_GCR_SYS_STAT_CODEINTERR_POS)) /**< SYS_STAT_CODEINTERR Mask */
#define MXC_V_GCR_SYS_STAT_CODEINTERR_NOERR            ((uint32_t)0x0UL) /**< SYS_STAT_CODEINTERR_NOERR Value */
#define MXC_S_GCR_SYS_STAT_CODEINTERR_NOERR            (MXC_V_GCR_SYS_STAT_CODEINTERR_NOERR << MXC_F_GCR_SYS_STAT_CODEINTERR_POS) /**< SYS_STAT_CODEINTERR_NOERR Setting */
#define MXC_V_GCR_SYS_STAT_CODEINTERR_ERR              ((uint32_t)0x1UL) /**< SYS_STAT_CODEINTERR_ERR Value */
#define MXC_S_GCR_SYS_STAT_CODEINTERR_ERR              (MXC_V_GCR_SYS_STAT_CODEINTERR_ERR << MXC_F_GCR_SYS_STAT_CODEINTERR_POS) /**< SYS_STAT_CODEINTERR_ERR Setting */

#define MXC_F_GCR_SYS_STAT_SCMEMF_POS                  5 /**< SYS_STAT_SCMEMF Position */
#define MXC_F_GCR_SYS_STAT_SCMEMF                      ((uint32_t)(0x1UL << MXC_F_GCR_SYS_STAT_SCMEMF_POS)) /**< SYS_STAT_SCMEMF Mask */
#define MXC_V_GCR_SYS_STAT_SCMEMF_NOERR                ((uint32_t)0x0UL) /**< SYS_STAT_SCMEMF_NOERR Value */
#define MXC_S_GCR_SYS_STAT_SCMEMF_NOERR                (MXC_V_GCR_SYS_STAT_SCMEMF_NOERR << MXC_F_GCR_SYS_STAT_SCMEMF_POS) /**< SYS_STAT_SCMEMF_NOERR Setting */
#define MXC_V_GCR_SYS_STAT_SCMEMF_MEMFAULT             ((uint32_t)0x1UL) /**< SYS_STAT_SCMEMF_MEMFAULT Value */
#define MXC_S_GCR_SYS_STAT_SCMEMF_MEMFAULT             (MXC_V_GCR_SYS_STAT_SCMEMF_MEMFAULT << MXC_F_GCR_SYS_STAT_SCMEMF_POS) /**< SYS_STAT_SCMEMF_MEMFAULT Setting */

/**@} end of group GCR_SYS_STAT_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_RST1 GCR_RST1
 * @brief    Reset 1.
 * @{
 */
#define MXC_F_GCR_RST1_I2C1_POS                        0 /**< RST1_I2C1 Position */
#define MXC_F_GCR_RST1_I2C1                            ((uint32_t)(0x1UL << MXC_F_GCR_RST1_I2C1_POS)) /**< RST1_I2C1 Mask */

#define MXC_F_GCR_RST1_PT_POS                          1 /**< RST1_PT Position */
#define MXC_F_GCR_RST1_PT                              ((uint32_t)(0x1UL << MXC_F_GCR_RST1_PT_POS)) /**< RST1_PT Mask */

#define MXC_F_GCR_RST1_SPIXIP_POS                      3 /**< RST1_SPIXIP Position */
#define MXC_F_GCR_RST1_SPIXIP                          ((uint32_t)(0x1UL << MXC_F_GCR_RST1_SPIXIP_POS)) /**< RST1_SPIXIP Mask */

#define MXC_F_GCR_RST1_XSPIM_POS                       4 /**< RST1_XSPIM Position */
#define MXC_F_GCR_RST1_XSPIM                           ((uint32_t)(0x1UL << MXC_F_GCR_RST1_XSPIM_POS)) /**< RST1_XSPIM Mask */

#define MXC_F_GCR_RST1_GPIO3_POS                       5 /**< RST1_GPIO3 Position */
#define MXC_F_GCR_RST1_GPIO3                           ((uint32_t)(0x1UL << MXC_F_GCR_RST1_GPIO3_POS)) /**< RST1_GPIO3 Mask */

#define MXC_F_GCR_RST1_SDHC_POS                        6 /**< RST1_SDHC Position */
#define MXC_F_GCR_RST1_SDHC                            ((uint32_t)(0x1UL << MXC_F_GCR_RST1_SDHC_POS)) /**< RST1_SDHC Mask */

#define MXC_F_GCR_RST1_OWIRE_POS                       7 /**< RST1_OWIRE Position */
#define MXC_F_GCR_RST1_OWIRE                           ((uint32_t)(0x1UL << MXC_F_GCR_RST1_OWIRE_POS)) /**< RST1_OWIRE Mask */

#define MXC_F_GCR_RST1_WDT1_POS                        8 /**< RST1_WDT1 Position */
#define MXC_F_GCR_RST1_WDT1                            ((uint32_t)(0x1UL << MXC_F_GCR_RST1_WDT1_POS)) /**< RST1_WDT1 Mask */

#define MXC_F_GCR_RST1_SPI3_POS                        9 /**< RST1_SPI3 Position */
#define MXC_F_GCR_RST1_SPI3                            ((uint32_t)(0x1UL << MXC_F_GCR_RST1_SPI3_POS)) /**< RST1_SPI3 Mask */

#define MXC_F_GCR_RST1_I2S_POS                         10 /**< RST1_I2S Position */
#define MXC_F_GCR_RST1_I2S                             ((uint32_t)(0x1UL << MXC_F_GCR_RST1_I2S_POS)) /**< RST1_I2S Mask */

#define MXC_F_GCR_RST1_XIPR_POS                        15 /**< RST1_XIPR Position */
#define MXC_F_GCR_RST1_XIPR                            ((uint32_t)(0x1UL << MXC_F_GCR_RST1_XIPR_POS)) /**< RST1_XIPR Mask */

#define MXC_F_GCR_RST1_SEMA_POS                        16 /**< RST1_SEMA Position */
#define MXC_F_GCR_RST1_SEMA                            ((uint32_t)(0x1UL << MXC_F_GCR_RST1_SEMA_POS)) /**< RST1_SEMA Mask */

/**@} end of group GCR_RST1_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_PCLK_DIS1 GCR_PCLK_DIS1
 * @brief    Peripheral Clock Disable.
 * @{
 */
#define MXC_F_GCR_PCLK_DIS1_UART2_POS                  1 /**< PCLK_DIS1_UART2 Position */
#define MXC_F_GCR_PCLK_DIS1_UART2                      ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS1_UART2_POS)) /**< PCLK_DIS1_UART2 Mask */
#define MXC_V_GCR_PCLK_DIS1_UART2_EN                   ((uint32_t)0x0UL) /**< PCLK_DIS1_UART2_EN Value */
#define MXC_S_GCR_PCLK_DIS1_UART2_EN                   (MXC_V_GCR_PCLK_DIS1_UART2_EN << MXC_F_GCR_PCLK_DIS1_UART2_POS) /**< PCLK_DIS1_UART2_EN Setting */
#define MXC_V_GCR_PCLK_DIS1_UART2_DIS                  ((uint32_t)0x1UL) /**< PCLK_DIS1_UART2_DIS Value */
#define MXC_S_GCR_PCLK_DIS1_UART2_DIS                  (MXC_V_GCR_PCLK_DIS1_UART2_DIS << MXC_F_GCR_PCLK_DIS1_UART2_POS) /**< PCLK_DIS1_UART2_DIS Setting */

#define MXC_F_GCR_PCLK_DIS1_TRNG_POS                   2 /**< PCLK_DIS1_TRNG Position */
#define MXC_F_GCR_PCLK_DIS1_TRNG                       ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS1_TRNG_POS)) /**< PCLK_DIS1_TRNG Mask */
#define MXC_V_GCR_PCLK_DIS1_TRNG_EN                    ((uint32_t)0x0UL) /**< PCLK_DIS1_TRNG_EN Value */
#define MXC_S_GCR_PCLK_DIS1_TRNG_EN                    (MXC_V_GCR_PCLK_DIS1_TRNG_EN << MXC_F_GCR_PCLK_DIS1_TRNG_POS) /**< PCLK_DIS1_TRNG_EN Setting */
#define MXC_V_GCR_PCLK_DIS1_TRNG_DIS                   ((uint32_t)0x1UL) /**< PCLK_DIS1_TRNG_DIS Value */
#define MXC_S_GCR_PCLK_DIS1_TRNG_DIS                   (MXC_V_GCR_PCLK_DIS1_TRNG_DIS << MXC_F_GCR_PCLK_DIS1_TRNG_POS) /**< PCLK_DIS1_TRNG_DIS Setting */

#define MXC_F_GCR_PCLK_DIS1_SFLC_POS                   3 /**< PCLK_DIS1_SFLC Position */
#define MXC_F_GCR_PCLK_DIS1_SFLC                       ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS1_SFLC_POS)) /**< PCLK_DIS1_SFLC Mask */
#define MXC_V_GCR_PCLK_DIS1_SFLC_EN                    ((uint32_t)0x0UL) /**< PCLK_DIS1_SFLC_EN Value */
#define MXC_S_GCR_PCLK_DIS1_SFLC_EN                    (MXC_V_GCR_PCLK_DIS1_SFLC_EN << MXC_F_GCR_PCLK_DIS1_SFLC_POS) /**< PCLK_DIS1_SFLC_EN Setting */
#define MXC_V_GCR_PCLK_DIS1_SFLC_DIS                   ((uint32_t)0x1UL) /**< PCLK_DIS1_SFLC_DIS Value */
#define MXC_S_GCR_PCLK_DIS1_SFLC_DIS                   (MXC_V_GCR_PCLK_DIS1_SFLC_DIS << MXC_F_GCR_PCLK_DIS1_SFLC_POS) /**< PCLK_DIS1_SFLC_DIS Setting */

