analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/gcr_regs.h
#define MXC_F_GCR_PCLK_DIS1_HBC_POS                    4 /**< PCLK_DIS1_HBC Position */
#define MXC_F_GCR_PCLK_DIS1_HBC                        ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS1_HBC_POS)) /**< PCLK_DIS1_HBC Mask */
#define MXC_V_GCR_PCLK_DIS1_HBC_EN                     ((uint32_t)0x0UL) /**< PCLK_DIS1_HBC_EN Value */
#define MXC_S_GCR_PCLK_DIS1_HBC_EN                     (MXC_V_GCR_PCLK_DIS1_HBC_EN << MXC_F_GCR_PCLK_DIS1_HBC_POS) /**< PCLK_DIS1_HBC_EN Setting */
#define MXC_V_GCR_PCLK_DIS1_HBC_DIS                    ((uint32_t)0x1UL) /**< PCLK_DIS1_HBC_DIS Value */
#define MXC_S_GCR_PCLK_DIS1_HBC_DIS                    (MXC_V_GCR_PCLK_DIS1_HBC_DIS << MXC_F_GCR_PCLK_DIS1_HBC_POS) /**< PCLK_DIS1_HBC_DIS Setting */

#define MXC_F_GCR_PCLK_DIS1_GPIO3_POS                  6 /**< PCLK_DIS1_GPIO3 Position */
#define MXC_F_GCR_PCLK_DIS1_GPIO3                      ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS1_GPIO3_POS)) /**< PCLK_DIS1_GPIO3 Mask */
#define MXC_V_GCR_PCLK_DIS1_GPIO3_EN                   ((uint32_t)0x0UL) /**< PCLK_DIS1_GPIO3_EN Value */
#define MXC_S_GCR_PCLK_DIS1_GPIO3_EN                   (MXC_V_GCR_PCLK_DIS1_GPIO3_EN << MXC_F_GCR_PCLK_DIS1_GPIO3_POS) /**< PCLK_DIS1_GPIO3_EN Setting */
#define MXC_V_GCR_PCLK_DIS1_GPIO3_DIS                  ((uint32_t)0x1UL) /**< PCLK_DIS1_GPIO3_DIS Value */
#define MXC_S_GCR_PCLK_DIS1_GPIO3_DIS                  (MXC_V_GCR_PCLK_DIS1_GPIO3_DIS << MXC_F_GCR_PCLK_DIS1_GPIO3_POS) /**< PCLK_DIS1_GPIO3_DIS Setting */

#define MXC_F_GCR_PCLK_DIS1_SCACHE_POS                 7 /**< PCLK_DIS1_SCACHE Position */
#define MXC_F_GCR_PCLK_DIS1_SCACHE                     ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS1_SCACHE_POS)) /**< PCLK_DIS1_SCACHE Mask */
#define MXC_V_GCR_PCLK_DIS1_SCACHE_EN                  ((uint32_t)0x0UL) /**< PCLK_DIS1_SCACHE_EN Value */
#define MXC_S_GCR_PCLK_DIS1_SCACHE_EN                  (MXC_V_GCR_PCLK_DIS1_SCACHE_EN << MXC_F_GCR_PCLK_DIS1_SCACHE_POS) /**< PCLK_DIS1_SCACHE_EN Setting */
#define MXC_V_GCR_PCLK_DIS1_SCACHE_DIS                 ((uint32_t)0x1UL) /**< PCLK_DIS1_SCACHE_DIS Value */
#define MXC_S_GCR_PCLK_DIS1_SCACHE_DIS                 (MXC_V_GCR_PCLK_DIS1_SCACHE_DIS << MXC_F_GCR_PCLK_DIS1_SCACHE_POS) /**< PCLK_DIS1_SCACHE_DIS Setting */

#define MXC_F_GCR_PCLK_DIS1_SDMA_POS                   8 /**< PCLK_DIS1_SDMA Position */
#define MXC_F_GCR_PCLK_DIS1_SDMA                       ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS1_SDMA_POS)) /**< PCLK_DIS1_SDMA Mask */
#define MXC_V_GCR_PCLK_DIS1_SDMA_EN                    ((uint32_t)0x0UL) /**< PCLK_DIS1_SDMA_EN Value */
#define MXC_S_GCR_PCLK_DIS1_SDMA_EN                    (MXC_V_GCR_PCLK_DIS1_SDMA_EN << MXC_F_GCR_PCLK_DIS1_SDMA_POS) /**< PCLK_DIS1_SDMA_EN Setting */
#define MXC_V_GCR_PCLK_DIS1_SDMA_DIS                   ((uint32_t)0x1UL) /**< PCLK_DIS1_SDMA_DIS Value */
#define MXC_S_GCR_PCLK_DIS1_SDMA_DIS                   (MXC_V_GCR_PCLK_DIS1_SDMA_DIS << MXC_F_GCR_PCLK_DIS1_SDMA_POS) /**< PCLK_DIS1_SDMA_DIS Setting */

#define MXC_F_GCR_PCLK_DIS1_SEMA_POS                   9 /**< PCLK_DIS1_SEMA Position */
#define MXC_F_GCR_PCLK_DIS1_SEMA                       ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS1_SEMA_POS)) /**< PCLK_DIS1_SEMA Mask */
#define MXC_V_GCR_PCLK_DIS1_SEMA_EN                    ((uint32_t)0x0UL) /**< PCLK_DIS1_SEMA_EN Value */
#define MXC_S_GCR_PCLK_DIS1_SEMA_EN                    (MXC_V_GCR_PCLK_DIS1_SEMA_EN << MXC_F_GCR_PCLK_DIS1_SEMA_POS) /**< PCLK_DIS1_SEMA_EN Setting */
#define MXC_V_GCR_PCLK_DIS1_SEMA_DIS                   ((uint32_t)0x1UL) /**< PCLK_DIS1_SEMA_DIS Value */
#define MXC_S_GCR_PCLK_DIS1_SEMA_DIS                   (MXC_V_GCR_PCLK_DIS1_SEMA_DIS << MXC_F_GCR_PCLK_DIS1_SEMA_POS) /**< PCLK_DIS1_SEMA_DIS Setting */

#define MXC_F_GCR_PCLK_DIS1_SDHC_POS                   10 /**< PCLK_DIS1_SDHC Position */
#define MXC_F_GCR_PCLK_DIS1_SDHC                       ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS1_SDHC_POS)) /**< PCLK_DIS1_SDHC Mask */
#define MXC_V_GCR_PCLK_DIS1_SDHC_EN                    ((uint32_t)0x0UL) /**< PCLK_DIS1_SDHC_EN Value */
#define MXC_S_GCR_PCLK_DIS1_SDHC_EN                    (MXC_V_GCR_PCLK_DIS1_SDHC_EN << MXC_F_GCR_PCLK_DIS1_SDHC_POS) /**< PCLK_DIS1_SDHC_EN Setting */
#define MXC_V_GCR_PCLK_DIS1_SDHC_DIS                   ((uint32_t)0x1UL) /**< PCLK_DIS1_SDHC_DIS Value */
#define MXC_S_GCR_PCLK_DIS1_SDHC_DIS                   (MXC_V_GCR_PCLK_DIS1_SDHC_DIS << MXC_F_GCR_PCLK_DIS1_SDHC_POS) /**< PCLK_DIS1_SDHC_DIS Setting */

#define MXC_F_GCR_PCLK_DIS1_ICACHE_POS                 11 /**< PCLK_DIS1_ICACHE Position */
#define MXC_F_GCR_PCLK_DIS1_ICACHE                     ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS1_ICACHE_POS)) /**< PCLK_DIS1_ICACHE Mask */
#define MXC_V_GCR_PCLK_DIS1_ICACHE_EN                  ((uint32_t)0x0UL) /**< PCLK_DIS1_ICACHE_EN Value */
#define MXC_S_GCR_PCLK_DIS1_ICACHE_EN                  (MXC_V_GCR_PCLK_DIS1_ICACHE_EN << MXC_F_GCR_PCLK_DIS1_ICACHE_POS) /**< PCLK_DIS1_ICACHE_EN Setting */
#define MXC_V_GCR_PCLK_DIS1_ICACHE_DIS                 ((uint32_t)0x1UL) /**< PCLK_DIS1_ICACHE_DIS Value */
#define MXC_S_GCR_PCLK_DIS1_ICACHE_DIS                 (MXC_V_GCR_PCLK_DIS1_ICACHE_DIS << MXC_F_GCR_PCLK_DIS1_ICACHE_POS) /**< PCLK_DIS1_ICACHE_DIS Setting */

#define MXC_F_GCR_PCLK_DIS1_ICACHEXIPF_POS             12 /**< PCLK_DIS1_ICACHEXIPF Position */
#define MXC_F_GCR_PCLK_DIS1_ICACHEXIPF                 ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS1_ICACHEXIPF_POS)) /**< PCLK_DIS1_ICACHEXIPF Mask */
#define MXC_V_GCR_PCLK_DIS1_ICACHEXIPF_EN              ((uint32_t)0x0UL) /**< PCLK_DIS1_ICACHEXIPF_EN Value */
#define MXC_S_GCR_PCLK_DIS1_ICACHEXIPF_EN              (MXC_V_GCR_PCLK_DIS1_ICACHEXIPF_EN << MXC_F_GCR_PCLK_DIS1_ICACHEXIPF_POS) /**< PCLK_DIS1_ICACHEXIPF_EN Setting */
#define MXC_V_GCR_PCLK_DIS1_ICACHEXIPF_DIS             ((uint32_t)0x1UL) /**< PCLK_DIS1_ICACHEXIPF_DIS Value */
#define MXC_S_GCR_PCLK_DIS1_ICACHEXIPF_DIS             (MXC_V_GCR_PCLK_DIS1_ICACHEXIPF_DIS << MXC_F_GCR_PCLK_DIS1_ICACHEXIPF_POS) /**< PCLK_DIS1_ICACHEXIPF_DIS Setting */

#define MXC_F_GCR_PCLK_DIS1_OW_POS                     13 /**< PCLK_DIS1_OW Position */
#define MXC_F_GCR_PCLK_DIS1_OW                         ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS1_OW_POS)) /**< PCLK_DIS1_OW Mask */
#define MXC_V_GCR_PCLK_DIS1_OW_EN                      ((uint32_t)0x0UL) /**< PCLK_DIS1_OW_EN Value */
#define MXC_S_GCR_PCLK_DIS1_OW_EN                      (MXC_V_GCR_PCLK_DIS1_OW_EN << MXC_F_GCR_PCLK_DIS1_OW_POS) /**< PCLK_DIS1_OW_EN Setting */
#define MXC_V_GCR_PCLK_DIS1_OW_DIS                     ((uint32_t)0x1UL) /**< PCLK_DIS1_OW_DIS Value */
#define MXC_S_GCR_PCLK_DIS1_OW_DIS                     (MXC_V_GCR_PCLK_DIS1_OW_DIS << MXC_F_GCR_PCLK_DIS1_OW_POS) /**< PCLK_DIS1_OW_DIS Setting */

#define MXC_F_GCR_PCLK_DIS1_SPI3_POS                   14 /**< PCLK_DIS1_SPI3 Position */
#define MXC_F_GCR_PCLK_DIS1_SPI3                       ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS1_SPI3_POS)) /**< PCLK_DIS1_SPI3 Mask */
#define MXC_V_GCR_PCLK_DIS1_SPI3_EN                    ((uint32_t)0x0UL) /**< PCLK_DIS1_SPI3_EN Value */
#define MXC_S_GCR_PCLK_DIS1_SPI3_EN                    (MXC_V_GCR_PCLK_DIS1_SPI3_EN << MXC_F_GCR_PCLK_DIS1_SPI3_POS) /**< PCLK_DIS1_SPI3_EN Setting */
#define MXC_V_GCR_PCLK_DIS1_SPI3_DIS                   ((uint32_t)0x1UL) /**< PCLK_DIS1_SPI3_DIS Value */
#define MXC_S_GCR_PCLK_DIS1_SPI3_DIS                   (MXC_V_GCR_PCLK_DIS1_SPI3_DIS << MXC_F_GCR_PCLK_DIS1_SPI3_POS) /**< PCLK_DIS1_SPI3_DIS Setting */

