analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/gcr_regs.h
#define MXC_F_GCR_PCLK_DIS1_I2S_POS                    15 /**< PCLK_DIS1_I2S Position */
#define MXC_F_GCR_PCLK_DIS1_I2S                        ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS1_I2S_POS)) /**< PCLK_DIS1_I2S Mask */
#define MXC_V_GCR_PCLK_DIS1_I2S_EN                     ((uint32_t)0x0UL) /**< PCLK_DIS1_I2S_EN Value */
#define MXC_S_GCR_PCLK_DIS1_I2S_EN                     (MXC_V_GCR_PCLK_DIS1_I2S_EN << MXC_F_GCR_PCLK_DIS1_I2S_POS) /**< PCLK_DIS1_I2S_EN Setting */
#define MXC_V_GCR_PCLK_DIS1_I2S_DIS                    ((uint32_t)0x1UL) /**< PCLK_DIS1_I2S_DIS Value */
#define MXC_S_GCR_PCLK_DIS1_I2S_DIS                    (MXC_V_GCR_PCLK_DIS1_I2S_DIS << MXC_F_GCR_PCLK_DIS1_I2S_POS) /**< PCLK_DIS1_I2S_DIS Setting */

#define MXC_F_GCR_PCLK_DIS1_SPIXIPR_POS                20 /**< PCLK_DIS1_SPIXIPR Position */
#define MXC_F_GCR_PCLK_DIS1_SPIXIPR                    ((uint32_t)(0x1UL << MXC_F_GCR_PCLK_DIS1_SPIXIPR_POS)) /**< PCLK_DIS1_SPIXIPR Mask */
#define MXC_V_GCR_PCLK_DIS1_SPIXIPR_EN                 ((uint32_t)0x0UL) /**< PCLK_DIS1_SPIXIPR_EN Value */
#define MXC_S_GCR_PCLK_DIS1_SPIXIPR_EN                 (MXC_V_GCR_PCLK_DIS1_SPIXIPR_EN << MXC_F_GCR_PCLK_DIS1_SPIXIPR_POS) /**< PCLK_DIS1_SPIXIPR_EN Setting */
#define MXC_V_GCR_PCLK_DIS1_SPIXIPR_DIS                ((uint32_t)0x1UL) /**< PCLK_DIS1_SPIXIPR_DIS Value */
#define MXC_S_GCR_PCLK_DIS1_SPIXIPR_DIS                (MXC_V_GCR_PCLK_DIS1_SPIXIPR_DIS << MXC_F_GCR_PCLK_DIS1_SPIXIPR_POS) /**< PCLK_DIS1_SPIXIPR_DIS Setting */

/**@} end of group GCR_PCLK_DIS1_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_EVENT_EN GCR_EVENT_EN
 * @brief    Event Enable Register.
 * @{
 */
#define MXC_F_GCR_EVENT_EN_DMAEVENT_POS                0 /**< EVENT_EN_DMAEVENT Position */
#define MXC_F_GCR_EVENT_EN_DMAEVENT                    ((uint32_t)(0x1UL << MXC_F_GCR_EVENT_EN_DMAEVENT_POS)) /**< EVENT_EN_DMAEVENT Mask */
#define MXC_V_GCR_EVENT_EN_DMAEVENT_DIS                ((uint32_t)0x0UL) /**< EVENT_EN_DMAEVENT_DIS Value */
#define MXC_S_GCR_EVENT_EN_DMAEVENT_DIS                (MXC_V_GCR_EVENT_EN_DMAEVENT_DIS << MXC_F_GCR_EVENT_EN_DMAEVENT_POS) /**< EVENT_EN_DMAEVENT_DIS Setting */
#define MXC_V_GCR_EVENT_EN_DMAEVENT_EN                 ((uint32_t)0x1UL) /**< EVENT_EN_DMAEVENT_EN Value */
#define MXC_S_GCR_EVENT_EN_DMAEVENT_EN                 (MXC_V_GCR_EVENT_EN_DMAEVENT_EN << MXC_F_GCR_EVENT_EN_DMAEVENT_POS) /**< EVENT_EN_DMAEVENT_EN Setting */

#define MXC_F_GCR_EVENT_EN_RXEVENT_POS                 1 /**< EVENT_EN_RXEVENT Position */
#define MXC_F_GCR_EVENT_EN_RXEVENT                     ((uint32_t)(0x1UL << MXC_F_GCR_EVENT_EN_RXEVENT_POS)) /**< EVENT_EN_RXEVENT Mask */
#define MXC_V_GCR_EVENT_EN_RXEVENT_DIS                 ((uint32_t)0x0UL) /**< EVENT_EN_RXEVENT_DIS Value */
#define MXC_S_GCR_EVENT_EN_RXEVENT_DIS                 (MXC_V_GCR_EVENT_EN_RXEVENT_DIS << MXC_F_GCR_EVENT_EN_RXEVENT_POS) /**< EVENT_EN_RXEVENT_DIS Setting */
#define MXC_V_GCR_EVENT_EN_RXEVENT_EN                  ((uint32_t)0x1UL) /**< EVENT_EN_RXEVENT_EN Value */
#define MXC_S_GCR_EVENT_EN_RXEVENT_EN                  (MXC_V_GCR_EVENT_EN_RXEVENT_EN << MXC_F_GCR_EVENT_EN_RXEVENT_POS) /**< EVENT_EN_RXEVENT_EN Setting */

#define MXC_F_GCR_EVENT_EN_TXEVENT_POS                 2 /**< EVENT_EN_TXEVENT Position */
#define MXC_F_GCR_EVENT_EN_TXEVENT                     ((uint32_t)(0x1UL << MXC_F_GCR_EVENT_EN_TXEVENT_POS)) /**< EVENT_EN_TXEVENT Mask */
#define MXC_V_GCR_EVENT_EN_TXEVENT_DIS                 ((uint32_t)0x0UL) /**< EVENT_EN_TXEVENT_DIS Value */
#define MXC_S_GCR_EVENT_EN_TXEVENT_DIS                 (MXC_V_GCR_EVENT_EN_TXEVENT_DIS << MXC_F_GCR_EVENT_EN_TXEVENT_POS) /**< EVENT_EN_TXEVENT_DIS Setting */
#define MXC_V_GCR_EVENT_EN_TXEVENT_EN                  ((uint32_t)0x1UL) /**< EVENT_EN_TXEVENT_EN Value */
#define MXC_S_GCR_EVENT_EN_TXEVENT_EN                  (MXC_V_GCR_EVENT_EN_TXEVENT_EN << MXC_F_GCR_EVENT_EN_TXEVENT_POS) /**< EVENT_EN_TXEVENT_EN Setting */

/**@} end of group GCR_EVENT_EN_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_REV GCR_REV
 * @brief    Revision Register.
 * @{
 */
#define MXC_F_GCR_REV_REVISION_POS                     0 /**< REV_REVISION Position */
#define MXC_F_GCR_REV_REVISION                         ((uint32_t)(0xFFFFUL << MXC_F_GCR_REV_REVISION_POS)) /**< REV_REVISION Mask */

/**@} end of group GCR_REV_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_SYS_STAT_IE GCR_SYS_STAT_IE
 * @brief    System Status Interrupt Enable Register.
 * @{
 */
#define MXC_F_GCR_SYS_STAT_IE_ICEULIE_POS              0 /**< SYS_STAT_IE_ICEULIE Position */
#define MXC_F_GCR_SYS_STAT_IE_ICEULIE                  ((uint32_t)(0x1UL << MXC_F_GCR_SYS_STAT_IE_ICEULIE_POS)) /**< SYS_STAT_IE_ICEULIE Mask */
#define MXC_V_GCR_SYS_STAT_IE_ICEULIE_DIS              ((uint32_t)0x0UL) /**< SYS_STAT_IE_ICEULIE_DIS Value */
#define MXC_S_GCR_SYS_STAT_IE_ICEULIE_DIS              (MXC_V_GCR_SYS_STAT_IE_ICEULIE_DIS << MXC_F_GCR_SYS_STAT_IE_ICEULIE_POS) /**< SYS_STAT_IE_ICEULIE_DIS Setting */
#define MXC_V_GCR_SYS_STAT_IE_ICEULIE_EN               ((uint32_t)0x1UL) /**< SYS_STAT_IE_ICEULIE_EN Value */
#define MXC_S_GCR_SYS_STAT_IE_ICEULIE_EN               (MXC_V_GCR_SYS_STAT_IE_ICEULIE_EN << MXC_F_GCR_SYS_STAT_IE_ICEULIE_POS) /**< SYS_STAT_IE_ICEULIE_EN Setting */

#define MXC_F_GCR_SYS_STAT_IE_CIEIE_POS                1 /**< SYS_STAT_IE_CIEIE Position */
#define MXC_F_GCR_SYS_STAT_IE_CIEIE                    ((uint32_t)(0x1UL << MXC_F_GCR_SYS_STAT_IE_CIEIE_POS)) /**< SYS_STAT_IE_CIEIE Mask */
#define MXC_V_GCR_SYS_STAT_IE_CIEIE_DIS                ((uint32_t)0x0UL) /**< SYS_STAT_IE_CIEIE_DIS Value */
#define MXC_S_GCR_SYS_STAT_IE_CIEIE_DIS                (MXC_V_GCR_SYS_STAT_IE_CIEIE_DIS << MXC_F_GCR_SYS_STAT_IE_CIEIE_POS) /**< SYS_STAT_IE_CIEIE_DIS Setting */
#define MXC_V_GCR_SYS_STAT_IE_CIEIE_EN                 ((uint32_t)0x1UL) /**< SYS_STAT_IE_CIEIE_EN Value */
#define MXC_S_GCR_SYS_STAT_IE_CIEIE_EN                 (MXC_V_GCR_SYS_STAT_IE_CIEIE_EN << MXC_F_GCR_SYS_STAT_IE_CIEIE_POS) /**< SYS_STAT_IE_CIEIE_EN Setting */

#define MXC_F_GCR_SYS_STAT_IE_SCMFIE_POS               5 /**< SYS_STAT_IE_SCMFIE Position */
#define MXC_F_GCR_SYS_STAT_IE_SCMFIE                   ((uint32_t)(0x1UL << MXC_F_GCR_SYS_STAT_IE_SCMFIE_POS)) /**< SYS_STAT_IE_SCMFIE Mask */
#define MXC_V_GCR_SYS_STAT_IE_SCMFIE_DIS               ((uint32_t)0x0UL) /**< SYS_STAT_IE_SCMFIE_DIS Value */
#define MXC_S_GCR_SYS_STAT_IE_SCMFIE_DIS               (MXC_V_GCR_SYS_STAT_IE_SCMFIE_DIS << MXC_F_GCR_SYS_STAT_IE_SCMFIE_POS) /**< SYS_STAT_IE_SCMFIE_DIS Setting */
#define MXC_V_GCR_SYS_STAT_IE_SCMFIE_EN                ((uint32_t)0x1UL) /**< SYS_STAT_IE_SCMFIE_EN Value */
#define MXC_S_GCR_SYS_STAT_IE_SCMFIE_EN                (MXC_V_GCR_SYS_STAT_IE_SCMFIE_EN << MXC_F_GCR_SYS_STAT_IE_SCMFIE_POS) /**< SYS_STAT_IE_SCMFIE_EN Setting */

/**@} end of group GCR_SYS_STAT_IE_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_GCR_REGS_H_
